Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/usb_reg.h
/* 0x10 : usb_setup_data_0 */
#define USB_SETUP_DATA_0_OFFSET    (0x10)
#define USB_STS_SETUP_DATA_B0      USB_STS_SETUP_DATA_B0
#define USB_STS_SETUP_DATA_B0_POS  (0U)
#define USB_STS_SETUP_DATA_B0_LEN  (8U)
#define USB_STS_SETUP_DATA_B0_MSK  (((1U << USB_STS_SETUP_DATA_B0_LEN) - 1) << USB_STS_SETUP_DATA_B0_POS)
#define USB_STS_SETUP_DATA_B0_UMSK (~(((1U << USB_STS_SETUP_DATA_B0_LEN) - 1) << USB_STS_SETUP_DATA_B0_POS))
#define USB_STS_SETUP_DATA_B1      USB_STS_SETUP_DATA_B1
#define USB_STS_SETUP_DATA_B1_POS  (8U)
#define USB_STS_SETUP_DATA_B1_LEN  (8U)
#define USB_STS_SETUP_DATA_B1_MSK  (((1U << USB_STS_SETUP_DATA_B1_LEN) - 1) << USB_STS_SETUP_DATA_B1_POS)
#define USB_STS_SETUP_DATA_B1_UMSK (~(((1U << USB_STS_SETUP_DATA_B1_LEN) - 1) << USB_STS_SETUP_DATA_B1_POS))
#define USB_STS_SETUP_DATA_B2      USB_STS_SETUP_DATA_B2
#define USB_STS_SETUP_DATA_B2_POS  (16U)
#define USB_STS_SETUP_DATA_B2_LEN  (8U)
#define USB_STS_SETUP_DATA_B2_MSK  (((1U << USB_STS_SETUP_DATA_B2_LEN) - 1) << USB_STS_SETUP_DATA_B2_POS)
#define USB_STS_SETUP_DATA_B2_UMSK (~(((1U << USB_STS_SETUP_DATA_B2_LEN) - 1) << USB_STS_SETUP_DATA_B2_POS))
#define USB_STS_SETUP_DATA_B3      USB_STS_SETUP_DATA_B3
#define USB_STS_SETUP_DATA_B3_POS  (24U)
#define USB_STS_SETUP_DATA_B3_LEN  (8U)
#define USB_STS_SETUP_DATA_B3_MSK  (((1U << USB_STS_SETUP_DATA_B3_LEN) - 1) << USB_STS_SETUP_DATA_B3_POS)
#define USB_STS_SETUP_DATA_B3_UMSK (~(((1U << USB_STS_SETUP_DATA_B3_LEN) - 1) << USB_STS_SETUP_DATA_B3_POS))

/* 0x14 : usb_setup_data_1 */
#define USB_SETUP_DATA_1_OFFSET    (0x14)
#define USB_STS_SETUP_DATA_B4      USB_STS_SETUP_DATA_B4
#define USB_STS_SETUP_DATA_B4_POS  (0U)
#define USB_STS_SETUP_DATA_B4_LEN  (8U)
#define USB_STS_SETUP_DATA_B4_MSK  (((1U << USB_STS_SETUP_DATA_B4_LEN) - 1) << USB_STS_SETUP_DATA_B4_POS)
#define USB_STS_SETUP_DATA_B4_UMSK (~(((1U << USB_STS_SETUP_DATA_B4_LEN) - 1) << USB_STS_SETUP_DATA_B4_POS))
#define USB_STS_SETUP_DATA_B5      USB_STS_SETUP_DATA_B5
#define USB_STS_SETUP_DATA_B5_POS  (8U)
#define USB_STS_SETUP_DATA_B5_LEN  (8U)
#define USB_STS_SETUP_DATA_B5_MSK  (((1U << USB_STS_SETUP_DATA_B5_LEN) - 1) << USB_STS_SETUP_DATA_B5_POS)
#define USB_STS_SETUP_DATA_B5_UMSK (~(((1U << USB_STS_SETUP_DATA_B5_LEN) - 1) << USB_STS_SETUP_DATA_B5_POS))
#define USB_STS_SETUP_DATA_B6      USB_STS_SETUP_DATA_B6
#define USB_STS_SETUP_DATA_B6_POS  (16U)
#define USB_STS_SETUP_DATA_B6_LEN  (8U)
#define USB_STS_SETUP_DATA_B6_MSK  (((1U << USB_STS_SETUP_DATA_B6_LEN) - 1) << USB_STS_SETUP_DATA_B6_POS)
#define USB_STS_SETUP_DATA_B6_UMSK (~(((1U << USB_STS_SETUP_DATA_B6_LEN) - 1) << USB_STS_SETUP_DATA_B6_POS))
#define USB_STS_SETUP_DATA_B7      USB_STS_SETUP_DATA_B7
#define USB_STS_SETUP_DATA_B7_POS  (24U)
#define USB_STS_SETUP_DATA_B7_LEN  (8U)
#define USB_STS_SETUP_DATA_B7_MSK  (((1U << USB_STS_SETUP_DATA_B7_LEN) - 1) << USB_STS_SETUP_DATA_B7_POS)
#define USB_STS_SETUP_DATA_B7_UMSK (~(((1U << USB_STS_SETUP_DATA_B7_LEN) - 1) << USB_STS_SETUP_DATA_B7_POS))

/* 0x18 : usb_frame_no */
#define USB_FRAME_NO_OFFSET   (0x18)
#define USB_STS_FRAME_NO      USB_STS_FRAME_NO
#define USB_STS_FRAME_NO_POS  (0U)
#define USB_STS_FRAME_NO_LEN  (11U)
#define USB_STS_FRAME_NO_MSK  (((1U << USB_STS_FRAME_NO_LEN) - 1) << USB_STS_FRAME_NO_POS)
#define USB_STS_FRAME_NO_UMSK (~(((1U << USB_STS_FRAME_NO_LEN) - 1) << USB_STS_FRAME_NO_POS))
#define USB_STS_PID           USB_STS_PID
#define USB_STS_PID_POS       (12U)
#define USB_STS_PID_LEN       (4U)
#define USB_STS_PID_MSK       (((1U << USB_STS_PID_LEN) - 1) << USB_STS_PID_POS)
#define USB_STS_PID_UMSK      (~(((1U << USB_STS_PID_LEN) - 1) << USB_STS_PID_POS))
#define USB_STS_EP_NO         USB_STS_EP_NO
#define USB_STS_EP_NO_POS     (16U)
#define USB_STS_EP_NO_LEN     (4U)
#define USB_STS_EP_NO_MSK     (((1U << USB_STS_EP_NO_LEN) - 1) << USB_STS_EP_NO_POS)
#define USB_STS_EP_NO_UMSK    (~(((1U << USB_STS_EP_NO_LEN) - 1) << USB_STS_EP_NO_POS))

/* 0x1C : usb_error */
#define USB_ERROR_OFFSET     (0x1C)
#define USB_UTMI_RX_ERR      USB_UTMI_RX_ERR
#define USB_UTMI_RX_ERR_POS  (0U)
#define USB_UTMI_RX_ERR_LEN  (1U)
#define USB_UTMI_RX_ERR_MSK  (((1U << USB_UTMI_RX_ERR_LEN) - 1) << USB_UTMI_RX_ERR_POS)
#define USB_UTMI_RX_ERR_UMSK (~(((1U << USB_UTMI_RX_ERR_LEN) - 1) << USB_UTMI_RX_ERR_POS))
#define USB_XFER_TO_ERR      USB_XFER_TO_ERR
#define USB_XFER_TO_ERR_POS  (1U)
#define USB_XFER_TO_ERR_LEN  (1U)
#define USB_XFER_TO_ERR_MSK  (((1U << USB_XFER_TO_ERR_LEN) - 1) << USB_XFER_TO_ERR_POS)
#define USB_XFER_TO_ERR_UMSK (~(((1U << USB_XFER_TO_ERR_LEN) - 1) << USB_XFER_TO_ERR_POS))
#define USB_IVLD_EP_ERR      USB_IVLD_EP_ERR
#define USB_IVLD_EP_ERR_POS  (2U)
#define USB_IVLD_EP_ERR_LEN  (1U)
#define USB_IVLD_EP_ERR_MSK  (((1U << USB_IVLD_EP_ERR_LEN) - 1) << USB_IVLD_EP_ERR_POS)
#define USB_IVLD_EP_ERR_UMSK (~(((1U << USB_IVLD_EP_ERR_LEN) - 1) << USB_IVLD_EP_ERR_POS))
#define USB_PID_SEQ_ERR      USB_PID_SEQ_ERR
#define USB_PID_SEQ_ERR_POS  (3U)
#define USB_PID_SEQ_ERR_LEN  (1U)
#define USB_PID_SEQ_ERR_MSK  (((1U << USB_PID_SEQ_ERR_LEN) - 1) << USB_PID_SEQ_ERR_POS)
#define USB_PID_SEQ_ERR_UMSK (~(((1U << USB_PID_SEQ_ERR_LEN) - 1) << USB_PID_SEQ_ERR_POS))
#define USB_PID_CKS_ERR      USB_PID_CKS_ERR
#define USB_PID_CKS_ERR_POS  (4U)
#define USB_PID_CKS_ERR_LEN  (1U)
#define USB_PID_CKS_ERR_MSK  (((1U << USB_PID_CKS_ERR_LEN) - 1) << USB_PID_CKS_ERR_POS)
#define USB_PID_CKS_ERR_UMSK (~(((1U << USB_PID_CKS_ERR_LEN) - 1) << USB_PID_CKS_ERR_POS))
#define USB_CRC5_ERR         USB_CRC5_ERR
#define USB_CRC5_ERR_POS     (5U)
#define USB_CRC5_ERR_LEN     (1U)
#define USB_CRC5_ERR_MSK     (((1U << USB_CRC5_ERR_LEN) - 1) << USB_CRC5_ERR_POS)
#define USB_CRC5_ERR_UMSK    (~(((1U << USB_CRC5_ERR_LEN) - 1) << USB_CRC5_ERR_POS))
#define USB_CRC16_ERR        USB_CRC16_ERR
#define USB_CRC16_ERR_POS    (6U)
#define USB_CRC16_ERR_LEN    (1U)
#define USB_CRC16_ERR_MSK    (((1U << USB_CRC16_ERR_LEN) - 1) << USB_CRC16_ERR_POS)
#define USB_CRC16_ERR_UMSK   (~(((1U << USB_CRC16_ERR_LEN) - 1) << USB_CRC16_ERR_POS))

/* 0x20 : USB interrupt enable */
#define USB_INT_EN_OFFSET             (0x20)
#define USB_CR_SOF_EN                 USB_CR_SOF_EN
#define USB_CR_SOF_EN_POS             (0U)
#define USB_CR_SOF_EN_LEN             (1U)
#define USB_CR_SOF_EN_MSK             (((1U << USB_CR_SOF_EN_LEN) - 1) << USB_CR_SOF_EN_POS)
#define USB_CR_SOF_EN_UMSK            (~(((1U << USB_CR_SOF_EN_LEN) - 1) << USB_CR_SOF_EN_POS))
#define USB_CR_USB_RESET_EN           USB_CR_USB_RESET_EN
#define USB_CR_USB_RESET_EN_POS       (1U)
#define USB_CR_USB_RESET_EN_LEN       (1U)
#define USB_CR_USB_RESET_EN_MSK       (((1U << USB_CR_USB_RESET_EN_LEN) - 1) << USB_CR_USB_RESET_EN_POS)
#define USB_CR_USB_RESET_EN_UMSK      (~(((1U << USB_CR_USB_RESET_EN_LEN) - 1) << USB_CR_USB_RESET_EN_POS))
#define USB_CR_VBUS_TGL_EN            USB_CR_VBUS_TGL_EN
#define USB_CR_VBUS_TGL_EN_POS        (2U)
#define USB_CR_VBUS_TGL_EN_LEN        (1U)
#define USB_CR_VBUS_TGL_EN_MSK        (((1U << USB_CR_VBUS_TGL_EN_LEN) - 1) << USB_CR_VBUS_TGL_EN_POS)
#define USB_CR_VBUS_TGL_EN_UMSK       (~(((1U << USB_CR_VBUS_TGL_EN_LEN) - 1) << USB_CR_VBUS_TGL_EN_POS))
#define USB_CR_GET_DCT_CMD_EN         USB_CR_GET_DCT_CMD_EN
#define USB_CR_GET_DCT_CMD_EN_POS     (3U)
#define USB_CR_GET_DCT_CMD_EN_LEN     (1U)
#define USB_CR_GET_DCT_CMD_EN_MSK     (((1U << USB_CR_GET_DCT_CMD_EN_LEN) - 1) << USB_CR_GET_DCT_CMD_EN_POS)
#define USB_CR_GET_DCT_CMD_EN_UMSK    (~(((1U << USB_CR_GET_DCT_CMD_EN_LEN) - 1) << USB_CR_GET_DCT_CMD_EN_POS))
#define USB_CR_EP0_SETUP_CMD_EN       USB_CR_EP0_SETUP_CMD_EN
#define USB_CR_EP0_SETUP_CMD_EN_POS   (4U)
#define USB_CR_EP0_SETUP_CMD_EN_LEN   (1U)
#define USB_CR_EP0_SETUP_CMD_EN_MSK   (((1U << USB_CR_EP0_SETUP_CMD_EN_LEN) - 1) << USB_CR_EP0_SETUP_CMD_EN_POS)
#define USB_CR_EP0_SETUP_CMD_EN_UMSK  (~(((1U << USB_CR_EP0_SETUP_CMD_EN_LEN) - 1) << USB_CR_EP0_SETUP_CMD_EN_POS))
#define USB_CR_EP0_SETUP_DONE_EN      USB_CR_EP0_SETUP_DONE_EN
#define USB_CR_EP0_SETUP_DONE_EN_POS  (5U)
#define USB_CR_EP0_SETUP_DONE_EN_LEN  (1U)
#define USB_CR_EP0_SETUP_DONE_EN_MSK  (((1U << USB_CR_EP0_SETUP_DONE_EN_LEN) - 1) << USB_CR_EP0_SETUP_DONE_EN_POS)
#define USB_CR_EP0_SETUP_DONE_EN_UMSK (~(((1U << USB_CR_EP0_SETUP_DONE_EN_LEN) - 1) << USB_CR_EP0_SETUP_DONE_EN_POS))
#define USB_CR_EP0_IN_CMD_EN          USB_CR_EP0_IN_CMD_EN
#define USB_CR_EP0_IN_CMD_EN_POS      (6U)
#define USB_CR_EP0_IN_CMD_EN_LEN      (1U)
#define USB_CR_EP0_IN_CMD_EN_MSK      (((1U << USB_CR_EP0_IN_CMD_EN_LEN) - 1) << USB_CR_EP0_IN_CMD_EN_POS)
#define USB_CR_EP0_IN_CMD_EN_UMSK     (~(((1U << USB_CR_EP0_IN_CMD_EN_LEN) - 1) << USB_CR_EP0_IN_CMD_EN_POS))
#define USB_CR_EP0_IN_DONE_EN         USB_CR_EP0_IN_DONE_EN
#define USB_CR_EP0_IN_DONE_EN_POS     (7U)
#define USB_CR_EP0_IN_DONE_EN_LEN     (1U)
#define USB_CR_EP0_IN_DONE_EN_MSK     (((1U << USB_CR_EP0_IN_DONE_EN_LEN) - 1) << USB_CR_EP0_IN_DONE_EN_POS)
#define USB_CR_EP0_IN_DONE_EN_UMSK    (~(((1U << USB_CR_EP0_IN_DONE_EN_LEN) - 1) << USB_CR_EP0_IN_DONE_EN_POS))
#define USB_CR_EP0_OUT_CMD_EN         USB_CR_EP0_OUT_CMD_EN
#define USB_CR_EP0_OUT_CMD_EN_POS     (8U)
#define USB_CR_EP0_OUT_CMD_EN_LEN     (1U)
#define USB_CR_EP0_OUT_CMD_EN_MSK     (((1U << USB_CR_EP0_OUT_CMD_EN_LEN) - 1) << USB_CR_EP0_OUT_CMD_EN_POS)
#define USB_CR_EP0_OUT_CMD_EN_UMSK    (~(((1U << USB_CR_EP0_OUT_CMD_EN_LEN) - 1) << USB_CR_EP0_OUT_CMD_EN_POS))
#define USB_CR_EP0_OUT_DONE_EN        USB_CR_EP0_OUT_DONE_EN
#define USB_CR_EP0_OUT_DONE_EN_POS    (9U)
#define USB_CR_EP0_OUT_DONE_EN_LEN    (1U)
#define USB_CR_EP0_OUT_DONE_EN_MSK    (((1U << USB_CR_EP0_OUT_DONE_EN_LEN) - 1) << USB_CR_EP0_OUT_DONE_EN_POS)
#define USB_CR_EP0_OUT_DONE_EN_UMSK   (~(((1U << USB_CR_EP0_OUT_DONE_EN_LEN) - 1) << USB_CR_EP0_OUT_DONE_EN_POS))
#define USB_CR_EP1_CMD_EN             USB_CR_EP1_CMD_EN
#define USB_CR_EP1_CMD_EN_POS         (10U)
#define USB_CR_EP1_CMD_EN_LEN         (1U)
#define USB_CR_EP1_CMD_EN_MSK         (((1U << USB_CR_EP1_CMD_EN_LEN) - 1) << USB_CR_EP1_CMD_EN_POS)
#define USB_CR_EP1_CMD_EN_UMSK        (~(((1U << USB_CR_EP1_CMD_EN_LEN) - 1) << USB_CR_EP1_CMD_EN_POS))
#define USB_CR_EP1_DONE_EN            USB_CR_EP1_DONE_EN
#define USB_CR_EP1_DONE_EN_POS        (11U)
#define USB_CR_EP1_DONE_EN_LEN        (1U)
#define USB_CR_EP1_DONE_EN_MSK        (((1U << USB_CR_EP1_DONE_EN_LEN) - 1) << USB_CR_EP1_DONE_EN_POS)
#define USB_CR_EP1_DONE_EN_UMSK       (~(((1U << USB_CR_EP1_DONE_EN_LEN) - 1) << USB_CR_EP1_DONE_EN_POS))
#define USB_CR_EP2_CMD_EN             USB_CR_EP2_CMD_EN
#define USB_CR_EP2_CMD_EN_POS         (12U)
#define USB_CR_EP2_CMD_EN_LEN         (1U)
#define USB_CR_EP2_CMD_EN_MSK         (((1U << USB_CR_EP2_CMD_EN_LEN) - 1) << USB_CR_EP2_CMD_EN_POS)
#define USB_CR_EP2_CMD_EN_UMSK        (~(((1U << USB_CR_EP2_CMD_EN_LEN) - 1) << USB_CR_EP2_CMD_EN_POS))
#define USB_CR_EP2_DONE_EN            USB_CR_EP2_DONE_EN
#define USB_CR_EP2_DONE_EN_POS        (13U)
#define USB_CR_EP2_DONE_EN_LEN        (1U)
#define USB_CR_EP2_DONE_EN_MSK        (((1U << USB_CR_EP2_DONE_EN_LEN) - 1) << USB_CR_EP2_DONE_EN_POS)
#define USB_CR_EP2_DONE_EN_UMSK       (~(((1U << USB_CR_EP2_DONE_EN_LEN) - 1) << USB_CR_EP2_DONE_EN_POS))
#define USB_CR_EP3_CMD_EN             USB_CR_EP3_CMD_EN
#define USB_CR_EP3_CMD_EN_POS         (14U)
#define USB_CR_EP3_CMD_EN_LEN         (1U)
#define USB_CR_EP3_CMD_EN_MSK         (((1U << USB_CR_EP3_CMD_EN_LEN) - 1) << USB_CR_EP3_CMD_EN_POS)
#define USB_CR_EP3_CMD_EN_UMSK        (~(((1U << USB_CR_EP3_CMD_EN_LEN) - 1) << USB_CR_EP3_CMD_EN_POS))
#define USB_CR_EP3_DONE_EN            USB_CR_EP3_DONE_EN
#define USB_CR_EP3_DONE_EN_POS        (15U)
#define USB_CR_EP3_DONE_EN_LEN        (1U)
#define USB_CR_EP3_DONE_EN_MSK        (((1U << USB_CR_EP3_DONE_EN_LEN) - 1) << USB_CR_EP3_DONE_EN_POS)
#define USB_CR_EP3_DONE_EN_UMSK       (~(((1U << USB_CR_EP3_DONE_EN_LEN) - 1) << USB_CR_EP3_DONE_EN_POS))
#define USB_CR_EP4_CMD_EN             USB_CR_EP4_CMD_EN
#define USB_CR_EP4_CMD_EN_POS         (16U)
#define USB_CR_EP4_CMD_EN_LEN         (1U)
#define USB_CR_EP4_CMD_EN_MSK         (((1U << USB_CR_EP4_CMD_EN_LEN) - 1) << USB_CR_EP4_CMD_EN_POS)
#define USB_CR_EP4_CMD_EN_UMSK        (~(((1U << USB_CR_EP4_CMD_EN_LEN) - 1) << USB_CR_EP4_CMD_EN_POS))
#define USB_CR_EP4_DONE_EN            USB_CR_EP4_DONE_EN
#define USB_CR_EP4_DONE_EN_POS        (17U)
#define USB_CR_EP4_DONE_EN_LEN        (1U)
#define USB_CR_EP4_DONE_EN_MSK        (((1U << USB_CR_EP4_DONE_EN_LEN) - 1) << USB_CR_EP4_DONE_EN_POS)
#define USB_CR_EP4_DONE_EN_UMSK       (~(((1U << USB_CR_EP4_DONE_EN_LEN) - 1) << USB_CR_EP4_DONE_EN_POS))
#define USB_CR_EP5_CMD_EN             USB_CR_EP5_CMD_EN
#define USB_CR_EP5_CMD_EN_POS         (18U)
#define USB_CR_EP5_CMD_EN_LEN         (1U)
#define USB_CR_EP5_CMD_EN_MSK         (((1U << USB_CR_EP5_CMD_EN_LEN) - 1) << USB_CR_EP5_CMD_EN_POS)
#define USB_CR_EP5_CMD_EN_UMSK        (~(((1U << USB_CR_EP5_CMD_EN_LEN) - 1) << USB_CR_EP5_CMD_EN_POS))
#define USB_CR_EP5_DONE_EN            USB_CR_EP5_DONE_EN
#define USB_CR_EP5_DONE_EN_POS        (19U)
#define USB_CR_EP5_DONE_EN_LEN        (1U)
#define USB_CR_EP5_DONE_EN_MSK        (((1U << USB_CR_EP5_DONE_EN_LEN) - 1) << USB_CR_EP5_DONE_EN_POS)
#define USB_CR_EP5_DONE_EN_UMSK       (~(((1U << USB_CR_EP5_DONE_EN_LEN) - 1) << USB_CR_EP5_DONE_EN_POS))
#define USB_CR_EP6_CMD_EN             USB_CR_EP6_CMD_EN
#define USB_CR_EP6_CMD_EN_POS         (20U)
#define USB_CR_EP6_CMD_EN_LEN         (1U)
#define USB_CR_EP6_CMD_EN_MSK         (((1U << USB_CR_EP6_CMD_EN_LEN) - 1) << USB_CR_EP6_CMD_EN_POS)
#define USB_CR_EP6_CMD_EN_UMSK        (~(((1U << USB_CR_EP6_CMD_EN_LEN) - 1) << USB_CR_EP6_CMD_EN_POS))
#define USB_CR_EP6_DONE_EN            USB_CR_EP6_DONE_EN
#define USB_CR_EP6_DONE_EN_POS        (21U)
#define USB_CR_EP6_DONE_EN_LEN        (1U)
#define USB_CR_EP6_DONE_EN_MSK        (((1U << USB_CR_EP6_DONE_EN_LEN) - 1) << USB_CR_EP6_DONE_EN_POS)
#define USB_CR_EP6_DONE_EN_UMSK       (~(((1U << USB_CR_EP6_DONE_EN_LEN) - 1) << USB_CR_EP6_DONE_EN_POS))
#define USB_CR_EP7_CMD_EN             USB_CR_EP7_CMD_EN
#define USB_CR_EP7_CMD_EN_POS         (22U)
#define USB_CR_EP7_CMD_EN_LEN         (1U)
#define USB_CR_EP7_CMD_EN_MSK         (((1U << USB_CR_EP7_CMD_EN_LEN) - 1) << USB_CR_EP7_CMD_EN_POS)
#define USB_CR_EP7_CMD_EN_UMSK        (~(((1U << USB_CR_EP7_CMD_EN_LEN) - 1) << USB_CR_EP7_CMD_EN_POS))
#define USB_CR_EP7_DONE_EN            USB_CR_EP7_DONE_EN
#define USB_CR_EP7_DONE_EN_POS        (23U)
#define USB_CR_EP7_DONE_EN_LEN        (1U)
#define USB_CR_EP7_DONE_EN_MSK        (((1U << USB_CR_EP7_DONE_EN_LEN) - 1) << USB_CR_EP7_DONE_EN_POS)
#define USB_CR_EP7_DONE_EN_UMSK       (~(((1U << USB_CR_EP7_DONE_EN_LEN) - 1) << USB_CR_EP7_DONE_EN_POS))
#define USB_CR_USB_REND_EN            USB_CR_USB_REND_EN
#define USB_CR_USB_REND_EN_POS        (27U)
#define USB_CR_USB_REND_EN_LEN        (1U)
#define USB_CR_USB_REND_EN_MSK        (((1U << USB_CR_USB_REND_EN_LEN) - 1) << USB_CR_USB_REND_EN_POS)
#define USB_CR_USB_REND_EN_UMSK       (~(((1U << USB_CR_USB_REND_EN_LEN) - 1) << USB_CR_USB_REND_EN_POS))
#define USB_CR_LPM_WKUP_EN            USB_CR_LPM_WKUP_EN
#define USB_CR_LPM_WKUP_EN_POS        (28U)
#define USB_CR_LPM_WKUP_EN_LEN        (1U)
#define USB_CR_LPM_WKUP_EN_MSK        (((1U << USB_CR_LPM_WKUP_EN_LEN) - 1) << USB_CR_LPM_WKUP_EN_POS)
#define USB_CR_LPM_WKUP_EN_UMSK       (~(((1U << USB_CR_LPM_WKUP_EN_LEN) - 1) << USB_CR_LPM_WKUP_EN_POS))
#define USB_CR_LPM_PKT_EN             USB_CR_LPM_PKT_EN
#define USB_CR_LPM_PKT_EN_POS         (29U)
#define USB_CR_LPM_PKT_EN_LEN         (1U)
#define USB_CR_LPM_PKT_EN_MSK         (((1U << USB_CR_LPM_PKT_EN_LEN) - 1) << USB_CR_LPM_PKT_EN_POS)
#define USB_CR_LPM_PKT_EN_UMSK        (~(((1U << USB_CR_LPM_PKT_EN_LEN) - 1) << USB_CR_LPM_PKT_EN_POS))
#define USB_CR_SOF_3MS_EN             USB_CR_SOF_3MS_EN
#define USB_CR_SOF_3MS_EN_POS         (30U)
#define USB_CR_SOF_3MS_EN_LEN         (1U)
#define USB_CR_SOF_3MS_EN_MSK         (((1U << USB_CR_SOF_3MS_EN_LEN) - 1) << USB_CR_SOF_3MS_EN_POS)
#define USB_CR_SOF_3MS_EN_UMSK        (~(((1U << USB_CR_SOF_3MS_EN_LEN) - 1) << USB_CR_SOF_3MS_EN_POS))
#define USB_CR_USB_ERR_EN             USB_CR_USB_ERR_EN
#define USB_CR_USB_ERR_EN_POS         (31U)
#define USB_CR_USB_ERR_EN_LEN         (1U)
#define USB_CR_USB_ERR_EN_MSK         (((1U << USB_CR_USB_ERR_EN_LEN) - 1) << USB_CR_USB_ERR_EN_POS)
#define USB_CR_USB_ERR_EN_UMSK        (~(((1U << USB_CR_USB_ERR_EN_LEN) - 1) << USB_CR_USB_ERR_EN_POS))

