Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/usb_reg.h
/* 0x24 : USB interrupt status */
#define USB_INT_STS_OFFSET          (0x24)
#define USB_SOF_INT                 USB_SOF_INT
#define USB_SOF_INT_POS             (0U)
#define USB_SOF_INT_LEN             (1U)
#define USB_SOF_INT_MSK             (((1U << USB_SOF_INT_LEN) - 1) << USB_SOF_INT_POS)
#define USB_SOF_INT_UMSK            (~(((1U << USB_SOF_INT_LEN) - 1) << USB_SOF_INT_POS))
#define USB_RESET_INT               USB_RESET_INT
#define USB_RESET_INT_POS           (1U)
#define USB_RESET_INT_LEN           (1U)
#define USB_RESET_INT_MSK           (((1U << USB_RESET_INT_LEN) - 1) << USB_RESET_INT_POS)
#define USB_RESET_INT_UMSK          (~(((1U << USB_RESET_INT_LEN) - 1) << USB_RESET_INT_POS))
#define USB_VBUS_TGL_INT            USB_VBUS_TGL_INT
#define USB_VBUS_TGL_INT_POS        (2U)
#define USB_VBUS_TGL_INT_LEN        (1U)
#define USB_VBUS_TGL_INT_MSK        (((1U << USB_VBUS_TGL_INT_LEN) - 1) << USB_VBUS_TGL_INT_POS)
#define USB_VBUS_TGL_INT_UMSK       (~(((1U << USB_VBUS_TGL_INT_LEN) - 1) << USB_VBUS_TGL_INT_POS))
#define USB_GET_DCT_CMD_INT         USB_GET_DCT_CMD_INT
#define USB_GET_DCT_CMD_INT_POS     (3U)
#define USB_GET_DCT_CMD_INT_LEN     (1U)
#define USB_GET_DCT_CMD_INT_MSK     (((1U << USB_GET_DCT_CMD_INT_LEN) - 1) << USB_GET_DCT_CMD_INT_POS)
#define USB_GET_DCT_CMD_INT_UMSK    (~(((1U << USB_GET_DCT_CMD_INT_LEN) - 1) << USB_GET_DCT_CMD_INT_POS))
#define USB_EP0_SETUP_CMD_INT       USB_EP0_SETUP_CMD_INT
#define USB_EP0_SETUP_CMD_INT_POS   (4U)
#define USB_EP0_SETUP_CMD_INT_LEN   (1U)
#define USB_EP0_SETUP_CMD_INT_MSK   (((1U << USB_EP0_SETUP_CMD_INT_LEN) - 1) << USB_EP0_SETUP_CMD_INT_POS)
#define USB_EP0_SETUP_CMD_INT_UMSK  (~(((1U << USB_EP0_SETUP_CMD_INT_LEN) - 1) << USB_EP0_SETUP_CMD_INT_POS))
#define USB_EP0_SETUP_DONE_INT      USB_EP0_SETUP_DONE_INT
#define USB_EP0_SETUP_DONE_INT_POS  (5U)
#define USB_EP0_SETUP_DONE_INT_LEN  (1U)
#define USB_EP0_SETUP_DONE_INT_MSK  (((1U << USB_EP0_SETUP_DONE_INT_LEN) - 1) << USB_EP0_SETUP_DONE_INT_POS)
#define USB_EP0_SETUP_DONE_INT_UMSK (~(((1U << USB_EP0_SETUP_DONE_INT_LEN) - 1) << USB_EP0_SETUP_DONE_INT_POS))
#define USB_EP0_IN_CMD_INT          USB_EP0_IN_CMD_INT
#define USB_EP0_IN_CMD_INT_POS      (6U)
#define USB_EP0_IN_CMD_INT_LEN      (1U)
#define USB_EP0_IN_CMD_INT_MSK      (((1U << USB_EP0_IN_CMD_INT_LEN) - 1) << USB_EP0_IN_CMD_INT_POS)
#define USB_EP0_IN_CMD_INT_UMSK     (~(((1U << USB_EP0_IN_CMD_INT_LEN) - 1) << USB_EP0_IN_CMD_INT_POS))
#define USB_EP0_IN_DONE_INT         USB_EP0_IN_DONE_INT
#define USB_EP0_IN_DONE_INT_POS     (7U)
#define USB_EP0_IN_DONE_INT_LEN     (1U)
#define USB_EP0_IN_DONE_INT_MSK     (((1U << USB_EP0_IN_DONE_INT_LEN) - 1) << USB_EP0_IN_DONE_INT_POS)
#define USB_EP0_IN_DONE_INT_UMSK    (~(((1U << USB_EP0_IN_DONE_INT_LEN) - 1) << USB_EP0_IN_DONE_INT_POS))
#define USB_EP0_OUT_CMD_INT         USB_EP0_OUT_CMD_INT
#define USB_EP0_OUT_CMD_INT_POS     (8U)
#define USB_EP0_OUT_CMD_INT_LEN     (1U)
#define USB_EP0_OUT_CMD_INT_MSK     (((1U << USB_EP0_OUT_CMD_INT_LEN) - 1) << USB_EP0_OUT_CMD_INT_POS)
#define USB_EP0_OUT_CMD_INT_UMSK    (~(((1U << USB_EP0_OUT_CMD_INT_LEN) - 1) << USB_EP0_OUT_CMD_INT_POS))
#define USB_EP0_OUT_DONE_INT        USB_EP0_OUT_DONE_INT
#define USB_EP0_OUT_DONE_INT_POS    (9U)
#define USB_EP0_OUT_DONE_INT_LEN    (1U)
#define USB_EP0_OUT_DONE_INT_MSK    (((1U << USB_EP0_OUT_DONE_INT_LEN) - 1) << USB_EP0_OUT_DONE_INT_POS)
#define USB_EP0_OUT_DONE_INT_UMSK   (~(((1U << USB_EP0_OUT_DONE_INT_LEN) - 1) << USB_EP0_OUT_DONE_INT_POS))
#define USB_EP1_CMD_INT             USB_EP1_CMD_INT
#define USB_EP1_CMD_INT_POS         (10U)
#define USB_EP1_CMD_INT_LEN         (1U)
#define USB_EP1_CMD_INT_MSK         (((1U << USB_EP1_CMD_INT_LEN) - 1) << USB_EP1_CMD_INT_POS)
#define USB_EP1_CMD_INT_UMSK        (~(((1U << USB_EP1_CMD_INT_LEN) - 1) << USB_EP1_CMD_INT_POS))
#define USB_EP1_DONE_INT            USB_EP1_DONE_INT
#define USB_EP1_DONE_INT_POS        (11U)
#define USB_EP1_DONE_INT_LEN        (1U)
#define USB_EP1_DONE_INT_MSK        (((1U << USB_EP1_DONE_INT_LEN) - 1) << USB_EP1_DONE_INT_POS)
#define USB_EP1_DONE_INT_UMSK       (~(((1U << USB_EP1_DONE_INT_LEN) - 1) << USB_EP1_DONE_INT_POS))
#define USB_EP2_CMD_INT             USB_EP2_CMD_INT
#define USB_EP2_CMD_INT_POS         (12U)
#define USB_EP2_CMD_INT_LEN         (1U)
#define USB_EP2_CMD_INT_MSK         (((1U << USB_EP2_CMD_INT_LEN) - 1) << USB_EP2_CMD_INT_POS)
#define USB_EP2_CMD_INT_UMSK        (~(((1U << USB_EP2_CMD_INT_LEN) - 1) << USB_EP2_CMD_INT_POS))
#define USB_EP2_DONE_INT            USB_EP2_DONE_INT
#define USB_EP2_DONE_INT_POS        (13U)
#define USB_EP2_DONE_INT_LEN        (1U)
#define USB_EP2_DONE_INT_MSK        (((1U << USB_EP2_DONE_INT_LEN) - 1) << USB_EP2_DONE_INT_POS)
#define USB_EP2_DONE_INT_UMSK       (~(((1U << USB_EP2_DONE_INT_LEN) - 1) << USB_EP2_DONE_INT_POS))
#define USB_EP3_CMD_INT             USB_EP3_CMD_INT
#define USB_EP3_CMD_INT_POS         (14U)
#define USB_EP3_CMD_INT_LEN         (1U)
#define USB_EP3_CMD_INT_MSK         (((1U << USB_EP3_CMD_INT_LEN) - 1) << USB_EP3_CMD_INT_POS)
#define USB_EP3_CMD_INT_UMSK        (~(((1U << USB_EP3_CMD_INT_LEN) - 1) << USB_EP3_CMD_INT_POS))
#define USB_EP3_DONE_INT            USB_EP3_DONE_INT
#define USB_EP3_DONE_INT_POS        (15U)
#define USB_EP3_DONE_INT_LEN        (1U)
#define USB_EP3_DONE_INT_MSK        (((1U << USB_EP3_DONE_INT_LEN) - 1) << USB_EP3_DONE_INT_POS)
#define USB_EP3_DONE_INT_UMSK       (~(((1U << USB_EP3_DONE_INT_LEN) - 1) << USB_EP3_DONE_INT_POS))
#define USB_EP4_CMD_INT             USB_EP4_CMD_INT
#define USB_EP4_CMD_INT_POS         (16U)
#define USB_EP4_CMD_INT_LEN         (1U)
#define USB_EP4_CMD_INT_MSK         (((1U << USB_EP4_CMD_INT_LEN) - 1) << USB_EP4_CMD_INT_POS)
#define USB_EP4_CMD_INT_UMSK        (~(((1U << USB_EP4_CMD_INT_LEN) - 1) << USB_EP4_CMD_INT_POS))
#define USB_EP4_DONE_INT            USB_EP4_DONE_INT
#define USB_EP4_DONE_INT_POS        (17U)
#define USB_EP4_DONE_INT_LEN        (1U)
#define USB_EP4_DONE_INT_MSK        (((1U << USB_EP4_DONE_INT_LEN) - 1) << USB_EP4_DONE_INT_POS)
#define USB_EP4_DONE_INT_UMSK       (~(((1U << USB_EP4_DONE_INT_LEN) - 1) << USB_EP4_DONE_INT_POS))
#define USB_EP5_CMD_INT             USB_EP5_CMD_INT
#define USB_EP5_CMD_INT_POS         (18U)
#define USB_EP5_CMD_INT_LEN         (1U)
#define USB_EP5_CMD_INT_MSK         (((1U << USB_EP5_CMD_INT_LEN) - 1) << USB_EP5_CMD_INT_POS)
#define USB_EP5_CMD_INT_UMSK        (~(((1U << USB_EP5_CMD_INT_LEN) - 1) << USB_EP5_CMD_INT_POS))
#define USB_EP5_DONE_INT            USB_EP5_DONE_INT
#define USB_EP5_DONE_INT_POS        (19U)
#define USB_EP5_DONE_INT_LEN        (1U)
#define USB_EP5_DONE_INT_MSK        (((1U << USB_EP5_DONE_INT_LEN) - 1) << USB_EP5_DONE_INT_POS)
#define USB_EP5_DONE_INT_UMSK       (~(((1U << USB_EP5_DONE_INT_LEN) - 1) << USB_EP5_DONE_INT_POS))
#define USB_EP6_CMD_INT             USB_EP6_CMD_INT
#define USB_EP6_CMD_INT_POS         (20U)
#define USB_EP6_CMD_INT_LEN         (1U)
#define USB_EP6_CMD_INT_MSK         (((1U << USB_EP6_CMD_INT_LEN) - 1) << USB_EP6_CMD_INT_POS)
#define USB_EP6_CMD_INT_UMSK        (~(((1U << USB_EP6_CMD_INT_LEN) - 1) << USB_EP6_CMD_INT_POS))
#define USB_EP6_DONE_INT            USB_EP6_DONE_INT
#define USB_EP6_DONE_INT_POS        (21U)
#define USB_EP6_DONE_INT_LEN        (1U)
#define USB_EP6_DONE_INT_MSK        (((1U << USB_EP6_DONE_INT_LEN) - 1) << USB_EP6_DONE_INT_POS)
#define USB_EP6_DONE_INT_UMSK       (~(((1U << USB_EP6_DONE_INT_LEN) - 1) << USB_EP6_DONE_INT_POS))
#define USB_EP7_CMD_INT             USB_EP7_CMD_INT
#define USB_EP7_CMD_INT_POS         (22U)
#define USB_EP7_CMD_INT_LEN         (1U)
#define USB_EP7_CMD_INT_MSK         (((1U << USB_EP7_CMD_INT_LEN) - 1) << USB_EP7_CMD_INT_POS)
#define USB_EP7_CMD_INT_UMSK        (~(((1U << USB_EP7_CMD_INT_LEN) - 1) << USB_EP7_CMD_INT_POS))
#define USB_EP7_DONE_INT            USB_EP7_DONE_INT
#define USB_EP7_DONE_INT_POS        (23U)
#define USB_EP7_DONE_INT_LEN        (1U)
#define USB_EP7_DONE_INT_MSK        (((1U << USB_EP7_DONE_INT_LEN) - 1) << USB_EP7_DONE_INT_POS)
#define USB_EP7_DONE_INT_UMSK       (~(((1U << USB_EP7_DONE_INT_LEN) - 1) << USB_EP7_DONE_INT_POS))
#define USB_REND_INT                USB_REND_INT
#define USB_REND_INT_POS            (27U)
#define USB_REND_INT_LEN            (1U)
#define USB_REND_INT_MSK            (((1U << USB_REND_INT_LEN) - 1) << USB_REND_INT_POS)
#define USB_REND_INT_UMSK           (~(((1U << USB_REND_INT_LEN) - 1) << USB_REND_INT_POS))
#define USB_LPM_WKUP_INT            USB_LPM_WKUP_INT
#define USB_LPM_WKUP_INT_POS        (28U)
#define USB_LPM_WKUP_INT_LEN        (1U)
#define USB_LPM_WKUP_INT_MSK        (((1U << USB_LPM_WKUP_INT_LEN) - 1) << USB_LPM_WKUP_INT_POS)
#define USB_LPM_WKUP_INT_UMSK       (~(((1U << USB_LPM_WKUP_INT_LEN) - 1) << USB_LPM_WKUP_INT_POS))
#define USB_LPM_PKT_INT             USB_LPM_PKT_INT
#define USB_LPM_PKT_INT_POS         (29U)
#define USB_LPM_PKT_INT_LEN         (1U)
#define USB_LPM_PKT_INT_MSK         (((1U << USB_LPM_PKT_INT_LEN) - 1) << USB_LPM_PKT_INT_POS)
#define USB_LPM_PKT_INT_UMSK        (~(((1U << USB_LPM_PKT_INT_LEN) - 1) << USB_LPM_PKT_INT_POS))
#define USB_SOF_3MS_INT             USB_SOF_3MS_INT
#define USB_SOF_3MS_INT_POS         (30U)
#define USB_SOF_3MS_INT_LEN         (1U)
#define USB_SOF_3MS_INT_MSK         (((1U << USB_SOF_3MS_INT_LEN) - 1) << USB_SOF_3MS_INT_POS)
#define USB_SOF_3MS_INT_UMSK        (~(((1U << USB_SOF_3MS_INT_LEN) - 1) << USB_SOF_3MS_INT_POS))
#define USB_ERR_INT                 USB_ERR_INT
#define USB_ERR_INT_POS             (31U)
#define USB_ERR_INT_LEN             (1U)
#define USB_ERR_INT_MSK             (((1U << USB_ERR_INT_LEN) - 1) << USB_ERR_INT_POS)
#define USB_ERR_INT_UMSK            (~(((1U << USB_ERR_INT_LEN) - 1) << USB_ERR_INT_POS))

/* 0x28 : USB interrupt mask */
#define USB_INT_MASK_OFFSET             (0x28)
#define USB_CR_SOF_MASK                 USB_CR_SOF_MASK
#define USB_CR_SOF_MASK_POS             (0U)
#define USB_CR_SOF_MASK_LEN             (1U)
#define USB_CR_SOF_MASK_MSK             (((1U << USB_CR_SOF_MASK_LEN) - 1) << USB_CR_SOF_MASK_POS)
#define USB_CR_SOF_MASK_UMSK            (~(((1U << USB_CR_SOF_MASK_LEN) - 1) << USB_CR_SOF_MASK_POS))
#define USB_CR_USB_RESET_MASK           USB_CR_USB_RESET_MASK
#define USB_CR_USB_RESET_MASK_POS       (1U)
#define USB_CR_USB_RESET_MASK_LEN       (1U)
#define USB_CR_USB_RESET_MASK_MSK       (((1U << USB_CR_USB_RESET_MASK_LEN) - 1) << USB_CR_USB_RESET_MASK_POS)
#define USB_CR_USB_RESET_MASK_UMSK      (~(((1U << USB_CR_USB_RESET_MASK_LEN) - 1) << USB_CR_USB_RESET_MASK_POS))
#define USB_CR_VBUS_TGL_MASK            USB_CR_VBUS_TGL_MASK
#define USB_CR_VBUS_TGL_MASK_POS        (2U)
#define USB_CR_VBUS_TGL_MASK_LEN        (1U)
#define USB_CR_VBUS_TGL_MASK_MSK        (((1U << USB_CR_VBUS_TGL_MASK_LEN) - 1) << USB_CR_VBUS_TGL_MASK_POS)
#define USB_CR_VBUS_TGL_MASK_UMSK       (~(((1U << USB_CR_VBUS_TGL_MASK_LEN) - 1) << USB_CR_VBUS_TGL_MASK_POS))
#define USB_CR_GET_DCT_CMD_MASK         USB_CR_GET_DCT_CMD_MASK
#define USB_CR_GET_DCT_CMD_MASK_POS     (3U)
#define USB_CR_GET_DCT_CMD_MASK_LEN     (1U)
#define USB_CR_GET_DCT_CMD_MASK_MSK     (((1U << USB_CR_GET_DCT_CMD_MASK_LEN) - 1) << USB_CR_GET_DCT_CMD_MASK_POS)
#define USB_CR_GET_DCT_CMD_MASK_UMSK    (~(((1U << USB_CR_GET_DCT_CMD_MASK_LEN) - 1) << USB_CR_GET_DCT_CMD_MASK_POS))
#define USB_CR_EP0_SETUP_CMD_MASK       USB_CR_EP0_SETUP_CMD_MASK
#define USB_CR_EP0_SETUP_CMD_MASK_POS   (4U)
#define USB_CR_EP0_SETUP_CMD_MASK_LEN   (1U)
#define USB_CR_EP0_SETUP_CMD_MASK_MSK   (((1U << USB_CR_EP0_SETUP_CMD_MASK_LEN) - 1) << USB_CR_EP0_SETUP_CMD_MASK_POS)
#define USB_CR_EP0_SETUP_CMD_MASK_UMSK  (~(((1U << USB_CR_EP0_SETUP_CMD_MASK_LEN) - 1) << USB_CR_EP0_SETUP_CMD_MASK_POS))
#define USB_CR_EP0_SETUP_DONE_MASK      USB_CR_EP0_SETUP_DONE_MASK
#define USB_CR_EP0_SETUP_DONE_MASK_POS  (5U)
#define USB_CR_EP0_SETUP_DONE_MASK_LEN  (1U)
#define USB_CR_EP0_SETUP_DONE_MASK_MSK  (((1U << USB_CR_EP0_SETUP_DONE_MASK_LEN) - 1) << USB_CR_EP0_SETUP_DONE_MASK_POS)
#define USB_CR_EP0_SETUP_DONE_MASK_UMSK (~(((1U << USB_CR_EP0_SETUP_DONE_MASK_LEN) - 1) << USB_CR_EP0_SETUP_DONE_MASK_POS))
#define USB_CR_EP0_IN_CMD_MASK          USB_CR_EP0_IN_CMD_MASK
#define USB_CR_EP0_IN_CMD_MASK_POS      (6U)
#define USB_CR_EP0_IN_CMD_MASK_LEN      (1U)
#define USB_CR_EP0_IN_CMD_MASK_MSK      (((1U << USB_CR_EP0_IN_CMD_MASK_LEN) - 1) << USB_CR_EP0_IN_CMD_MASK_POS)
#define USB_CR_EP0_IN_CMD_MASK_UMSK     (~(((1U << USB_CR_EP0_IN_CMD_MASK_LEN) - 1) << USB_CR_EP0_IN_CMD_MASK_POS))
#define USB_CR_EP0_IN_DONE_MASK         USB_CR_EP0_IN_DONE_MASK
#define USB_CR_EP0_IN_DONE_MASK_POS     (7U)
#define USB_CR_EP0_IN_DONE_MASK_LEN     (1U)
#define USB_CR_EP0_IN_DONE_MASK_MSK     (((1U << USB_CR_EP0_IN_DONE_MASK_LEN) - 1) << USB_CR_EP0_IN_DONE_MASK_POS)
#define USB_CR_EP0_IN_DONE_MASK_UMSK    (~(((1U << USB_CR_EP0_IN_DONE_MASK_LEN) - 1) << USB_CR_EP0_IN_DONE_MASK_POS))
#define USB_CR_EP0_OUT_CMD_MASK         USB_CR_EP0_OUT_CMD_MASK
#define USB_CR_EP0_OUT_CMD_MASK_POS     (8U)
#define USB_CR_EP0_OUT_CMD_MASK_LEN     (1U)
#define USB_CR_EP0_OUT_CMD_MASK_MSK     (((1U << USB_CR_EP0_OUT_CMD_MASK_LEN) - 1) << USB_CR_EP0_OUT_CMD_MASK_POS)
#define USB_CR_EP0_OUT_CMD_MASK_UMSK    (~(((1U << USB_CR_EP0_OUT_CMD_MASK_LEN) - 1) << USB_CR_EP0_OUT_CMD_MASK_POS))
#define USB_CR_EP0_OUT_DONE_MASK        USB_CR_EP0_OUT_DONE_MASK
#define USB_CR_EP0_OUT_DONE_MASK_POS    (9U)
#define USB_CR_EP0_OUT_DONE_MASK_LEN    (1U)
#define USB_CR_EP0_OUT_DONE_MASK_MSK    (((1U << USB_CR_EP0_OUT_DONE_MASK_LEN) - 1) << USB_CR_EP0_OUT_DONE_MASK_POS)
#define USB_CR_EP0_OUT_DONE_MASK_UMSK   (~(((1U << USB_CR_EP0_OUT_DONE_MASK_LEN) - 1) << USB_CR_EP0_OUT_DONE_MASK_POS))
#define USB_CR_EP1_CMD_MASK             USB_CR_EP1_CMD_MASK
#define USB_CR_EP1_CMD_MASK_POS         (10U)
#define USB_CR_EP1_CMD_MASK_LEN         (1U)
#define USB_CR_EP1_CMD_MASK_MSK         (((1U << USB_CR_EP1_CMD_MASK_LEN) - 1) << USB_CR_EP1_CMD_MASK_POS)
#define USB_CR_EP1_CMD_MASK_UMSK        (~(((1U << USB_CR_EP1_CMD_MASK_LEN) - 1) << USB_CR_EP1_CMD_MASK_POS))
#define USB_CR_EP1_DONE_MASK            USB_CR_EP1_DONE_MASK
#define USB_CR_EP1_DONE_MASK_POS        (11U)
#define USB_CR_EP1_DONE_MASK_LEN        (1U)
#define USB_CR_EP1_DONE_MASK_MSK        (((1U << USB_CR_EP1_DONE_MASK_LEN) - 1) << USB_CR_EP1_DONE_MASK_POS)
#define USB_CR_EP1_DONE_MASK_UMSK       (~(((1U << USB_CR_EP1_DONE_MASK_LEN) - 1) << USB_CR_EP1_DONE_MASK_POS))
#define USB_CR_EP2_CMD_MASK             USB_CR_EP2_CMD_MASK
#define USB_CR_EP2_CMD_MASK_POS         (12U)
#define USB_CR_EP2_CMD_MASK_LEN         (1U)
#define USB_CR_EP2_CMD_MASK_MSK         (((1U << USB_CR_EP2_CMD_MASK_LEN) - 1) << USB_CR_EP2_CMD_MASK_POS)
#define USB_CR_EP2_CMD_MASK_UMSK        (~(((1U << USB_CR_EP2_CMD_MASK_LEN) - 1) << USB_CR_EP2_CMD_MASK_POS))
#define USB_CR_EP2_DONE_MASK            USB_CR_EP2_DONE_MASK
#define USB_CR_EP2_DONE_MASK_POS        (13U)
#define USB_CR_EP2_DONE_MASK_LEN        (1U)
#define USB_CR_EP2_DONE_MASK_MSK        (((1U << USB_CR_EP2_DONE_MASK_LEN) - 1) << USB_CR_EP2_DONE_MASK_POS)
#define USB_CR_EP2_DONE_MASK_UMSK       (~(((1U << USB_CR_EP2_DONE_MASK_LEN) - 1) << USB_CR_EP2_DONE_MASK_POS))
#define USB_CR_EP3_CMD_MASK             USB_CR_EP3_CMD_MASK
#define USB_CR_EP3_CMD_MASK_POS         (14U)
#define USB_CR_EP3_CMD_MASK_LEN         (1U)
#define USB_CR_EP3_CMD_MASK_MSK         (((1U << USB_CR_EP3_CMD_MASK_LEN) - 1) << USB_CR_EP3_CMD_MASK_POS)
#define USB_CR_EP3_CMD_MASK_UMSK        (~(((1U << USB_CR_EP3_CMD_MASK_LEN) - 1) << USB_CR_EP3_CMD_MASK_POS))
#define USB_CR_EP3_DONE_MASK            USB_CR_EP3_DONE_MASK
#define USB_CR_EP3_DONE_MASK_POS        (15U)
#define USB_CR_EP3_DONE_MASK_LEN        (1U)
#define USB_CR_EP3_DONE_MASK_MSK        (((1U << USB_CR_EP3_DONE_MASK_LEN) - 1) << USB_CR_EP3_DONE_MASK_POS)
#define USB_CR_EP3_DONE_MASK_UMSK       (~(((1U << USB_CR_EP3_DONE_MASK_LEN) - 1) << USB_CR_EP3_DONE_MASK_POS))
#define USB_CR_EP4_CMD_MASK             USB_CR_EP4_CMD_MASK
#define USB_CR_EP4_CMD_MASK_POS         (16U)
#define USB_CR_EP4_CMD_MASK_LEN         (1U)
#define USB_CR_EP4_CMD_MASK_MSK         (((1U << USB_CR_EP4_CMD_MASK_LEN) - 1) << USB_CR_EP4_CMD_MASK_POS)
#define USB_CR_EP4_CMD_MASK_UMSK        (~(((1U << USB_CR_EP4_CMD_MASK_LEN) - 1) << USB_CR_EP4_CMD_MASK_POS))
#define USB_CR_EP4_DONE_MASK            USB_CR_EP4_DONE_MASK
#define USB_CR_EP4_DONE_MASK_POS        (17U)
#define USB_CR_EP4_DONE_MASK_LEN        (1U)
#define USB_CR_EP4_DONE_MASK_MSK        (((1U << USB_CR_EP4_DONE_MASK_LEN) - 1) << USB_CR_EP4_DONE_MASK_POS)
#define USB_CR_EP4_DONE_MASK_UMSK       (~(((1U << USB_CR_EP4_DONE_MASK_LEN) - 1) << USB_CR_EP4_DONE_MASK_POS))
#define USB_CR_EP5_CMD_MASK             USB_CR_EP5_CMD_MASK
#define USB_CR_EP5_CMD_MASK_POS         (18U)
#define USB_CR_EP5_CMD_MASK_LEN         (1U)
#define USB_CR_EP5_CMD_MASK_MSK         (((1U << USB_CR_EP5_CMD_MASK_LEN) - 1) << USB_CR_EP5_CMD_MASK_POS)
#define USB_CR_EP5_CMD_MASK_UMSK        (~(((1U << USB_CR_EP5_CMD_MASK_LEN) - 1) << USB_CR_EP5_CMD_MASK_POS))
#define USB_CR_EP5_DONE_MASK            USB_CR_EP5_DONE_MASK
#define USB_CR_EP5_DONE_MASK_POS        (19U)
#define USB_CR_EP5_DONE_MASK_LEN        (1U)
#define USB_CR_EP5_DONE_MASK_MSK        (((1U << USB_CR_EP5_DONE_MASK_LEN) - 1) << USB_CR_EP5_DONE_MASK_POS)
#define USB_CR_EP5_DONE_MASK_UMSK       (~(((1U << USB_CR_EP5_DONE_MASK_LEN) - 1) << USB_CR_EP5_DONE_MASK_POS))
#define USB_CR_EP6_CMD_MASK             USB_CR_EP6_CMD_MASK
#define USB_CR_EP6_CMD_MASK_POS         (20U)
#define USB_CR_EP6_CMD_MASK_LEN         (1U)
#define USB_CR_EP6_CMD_MASK_MSK         (((1U << USB_CR_EP6_CMD_MASK_LEN) - 1) << USB_CR_EP6_CMD_MASK_POS)
#define USB_CR_EP6_CMD_MASK_UMSK        (~(((1U << USB_CR_EP6_CMD_MASK_LEN) - 1) << USB_CR_EP6_CMD_MASK_POS))
#define USB_CR_EP6_DONE_MASK            USB_CR_EP6_DONE_MASK
#define USB_CR_EP6_DONE_MASK_POS        (21U)
#define USB_CR_EP6_DONE_MASK_LEN        (1U)
#define USB_CR_EP6_DONE_MASK_MSK        (((1U << USB_CR_EP6_DONE_MASK_LEN) - 1) << USB_CR_EP6_DONE_MASK_POS)
#define USB_CR_EP6_DONE_MASK_UMSK       (~(((1U << USB_CR_EP6_DONE_MASK_LEN) - 1) << USB_CR_EP6_DONE_MASK_POS))
#define USB_CR_EP7_CMD_MASK             USB_CR_EP7_CMD_MASK
#define USB_CR_EP7_CMD_MASK_POS         (22U)
#define USB_CR_EP7_CMD_MASK_LEN         (1U)
#define USB_CR_EP7_CMD_MASK_MSK         (((1U << USB_CR_EP7_CMD_MASK_LEN) - 1) << USB_CR_EP7_CMD_MASK_POS)
#define USB_CR_EP7_CMD_MASK_UMSK        (~(((1U << USB_CR_EP7_CMD_MASK_LEN) - 1) << USB_CR_EP7_CMD_MASK_POS))
#define USB_CR_EP7_DONE_MASK            USB_CR_EP7_DONE_MASK
#define USB_CR_EP7_DONE_MASK_POS        (23U)
#define USB_CR_EP7_DONE_MASK_LEN        (1U)
#define USB_CR_EP7_DONE_MASK_MSK        (((1U << USB_CR_EP7_DONE_MASK_LEN) - 1) << USB_CR_EP7_DONE_MASK_POS)
#define USB_CR_EP7_DONE_MASK_UMSK       (~(((1U << USB_CR_EP7_DONE_MASK_LEN) - 1) << USB_CR_EP7_DONE_MASK_POS))
#define USB_CR_USB_REND_MASK            USB_CR_USB_REND_MASK
#define USB_CR_USB_REND_MASK_POS        (27U)
#define USB_CR_USB_REND_MASK_LEN        (1U)
#define USB_CR_USB_REND_MASK_MSK        (((1U << USB_CR_USB_REND_MASK_LEN) - 1) << USB_CR_USB_REND_MASK_POS)
#define USB_CR_USB_REND_MASK_UMSK       (~(((1U << USB_CR_USB_REND_MASK_LEN) - 1) << USB_CR_USB_REND_MASK_POS))
#define USB_CR_LPM_WKUP_MASK            USB_CR_LPM_WKUP_MASK
#define USB_CR_LPM_WKUP_MASK_POS        (28U)
#define USB_CR_LPM_WKUP_MASK_LEN        (1U)
#define USB_CR_LPM_WKUP_MASK_MSK        (((1U << USB_CR_LPM_WKUP_MASK_LEN) - 1) << USB_CR_LPM_WKUP_MASK_POS)
#define USB_CR_LPM_WKUP_MASK_UMSK       (~(((1U << USB_CR_LPM_WKUP_MASK_LEN) - 1) << USB_CR_LPM_WKUP_MASK_POS))
#define USB_CR_LPM_PKT_MASK             USB_CR_LPM_PKT_MASK
#define USB_CR_LPM_PKT_MASK_POS         (29U)
#define USB_CR_LPM_PKT_MASK_LEN         (1U)
#define USB_CR_LPM_PKT_MASK_MSK         (((1U << USB_CR_LPM_PKT_MASK_LEN) - 1) << USB_CR_LPM_PKT_MASK_POS)
#define USB_CR_LPM_PKT_MASK_UMSK        (~(((1U << USB_CR_LPM_PKT_MASK_LEN) - 1) << USB_CR_LPM_PKT_MASK_POS))
#define USB_CR_SOF_3MS_MASK             USB_CR_SOF_3MS_MASK
#define USB_CR_SOF_3MS_MASK_POS         (30U)
#define USB_CR_SOF_3MS_MASK_LEN         (1U)
#define USB_CR_SOF_3MS_MASK_MSK         (((1U << USB_CR_SOF_3MS_MASK_LEN) - 1) << USB_CR_SOF_3MS_MASK_POS)
#define USB_CR_SOF_3MS_MASK_UMSK        (~(((1U << USB_CR_SOF_3MS_MASK_LEN) - 1) << USB_CR_SOF_3MS_MASK_POS))
#define USB_CR_USB_ERR_MASK             USB_CR_USB_ERR_MASK
#define USB_CR_USB_ERR_MASK_POS         (31U)
#define USB_CR_USB_ERR_MASK_LEN         (1U)
#define USB_CR_USB_ERR_MASK_MSK         (((1U << USB_CR_USB_ERR_MASK_LEN) - 1) << USB_CR_USB_ERR_MASK_POS)
#define USB_CR_USB_ERR_MASK_UMSK        (~(((1U << USB_CR_USB_ERR_MASK_LEN) - 1) << USB_CR_USB_ERR_MASK_POS))

