Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/usb_reg.h
/* 0x2C : USB interrupt clear */
#define USB_INT_CLEAR_OFFSET           (0x2C)
#define USB_CR_SOF_CLR                 USB_CR_SOF_CLR
#define USB_CR_SOF_CLR_POS             (0U)
#define USB_CR_SOF_CLR_LEN             (1U)
#define USB_CR_SOF_CLR_MSK             (((1U << USB_CR_SOF_CLR_LEN) - 1) << USB_CR_SOF_CLR_POS)
#define USB_CR_SOF_CLR_UMSK            (~(((1U << USB_CR_SOF_CLR_LEN) - 1) << USB_CR_SOF_CLR_POS))
#define USB_CR_USB_RESET_CLR           USB_CR_USB_RESET_CLR
#define USB_CR_USB_RESET_CLR_POS       (1U)
#define USB_CR_USB_RESET_CLR_LEN       (1U)
#define USB_CR_USB_RESET_CLR_MSK       (((1U << USB_CR_USB_RESET_CLR_LEN) - 1) << USB_CR_USB_RESET_CLR_POS)
#define USB_CR_USB_RESET_CLR_UMSK      (~(((1U << USB_CR_USB_RESET_CLR_LEN) - 1) << USB_CR_USB_RESET_CLR_POS))
#define USB_CR_VBUS_TGL_CLR            USB_CR_VBUS_TGL_CLR
#define USB_CR_VBUS_TGL_CLR_POS        (2U)
#define USB_CR_VBUS_TGL_CLR_LEN        (1U)
#define USB_CR_VBUS_TGL_CLR_MSK        (((1U << USB_CR_VBUS_TGL_CLR_LEN) - 1) << USB_CR_VBUS_TGL_CLR_POS)
#define USB_CR_VBUS_TGL_CLR_UMSK       (~(((1U << USB_CR_VBUS_TGL_CLR_LEN) - 1) << USB_CR_VBUS_TGL_CLR_POS))
#define USB_CR_GET_DCT_CMD_CLR         USB_CR_GET_DCT_CMD_CLR
#define USB_CR_GET_DCT_CMD_CLR_POS     (3U)
#define USB_CR_GET_DCT_CMD_CLR_LEN     (1U)
#define USB_CR_GET_DCT_CMD_CLR_MSK     (((1U << USB_CR_GET_DCT_CMD_CLR_LEN) - 1) << USB_CR_GET_DCT_CMD_CLR_POS)
#define USB_CR_GET_DCT_CMD_CLR_UMSK    (~(((1U << USB_CR_GET_DCT_CMD_CLR_LEN) - 1) << USB_CR_GET_DCT_CMD_CLR_POS))
#define USB_CR_EP0_SETUP_CMD_CLR       USB_CR_EP0_SETUP_CMD_CLR
#define USB_CR_EP0_SETUP_CMD_CLR_POS   (4U)
#define USB_CR_EP0_SETUP_CMD_CLR_LEN   (1U)
#define USB_CR_EP0_SETUP_CMD_CLR_MSK   (((1U << USB_CR_EP0_SETUP_CMD_CLR_LEN) - 1) << USB_CR_EP0_SETUP_CMD_CLR_POS)
#define USB_CR_EP0_SETUP_CMD_CLR_UMSK  (~(((1U << USB_CR_EP0_SETUP_CMD_CLR_LEN) - 1) << USB_CR_EP0_SETUP_CMD_CLR_POS))
#define USB_CR_EP0_SETUP_DONE_CLR      USB_CR_EP0_SETUP_DONE_CLR
#define USB_CR_EP0_SETUP_DONE_CLR_POS  (5U)
#define USB_CR_EP0_SETUP_DONE_CLR_LEN  (1U)
#define USB_CR_EP0_SETUP_DONE_CLR_MSK  (((1U << USB_CR_EP0_SETUP_DONE_CLR_LEN) - 1) << USB_CR_EP0_SETUP_DONE_CLR_POS)
#define USB_CR_EP0_SETUP_DONE_CLR_UMSK (~(((1U << USB_CR_EP0_SETUP_DONE_CLR_LEN) - 1) << USB_CR_EP0_SETUP_DONE_CLR_POS))
#define USB_CR_EP0_IN_CMD_CLR          USB_CR_EP0_IN_CMD_CLR
#define USB_CR_EP0_IN_CMD_CLR_POS      (6U)
#define USB_CR_EP0_IN_CMD_CLR_LEN      (1U)
#define USB_CR_EP0_IN_CMD_CLR_MSK      (((1U << USB_CR_EP0_IN_CMD_CLR_LEN) - 1) << USB_CR_EP0_IN_CMD_CLR_POS)
#define USB_CR_EP0_IN_CMD_CLR_UMSK     (~(((1U << USB_CR_EP0_IN_CMD_CLR_LEN) - 1) << USB_CR_EP0_IN_CMD_CLR_POS))
#define USB_CR_EP0_IN_DONE_CLR         USB_CR_EP0_IN_DONE_CLR
#define USB_CR_EP0_IN_DONE_CLR_POS     (7U)
#define USB_CR_EP0_IN_DONE_CLR_LEN     (1U)
#define USB_CR_EP0_IN_DONE_CLR_MSK     (((1U << USB_CR_EP0_IN_DONE_CLR_LEN) - 1) << USB_CR_EP0_IN_DONE_CLR_POS)
#define USB_CR_EP0_IN_DONE_CLR_UMSK    (~(((1U << USB_CR_EP0_IN_DONE_CLR_LEN) - 1) << USB_CR_EP0_IN_DONE_CLR_POS))
#define USB_CR_EP0_OUT_CMD_CLR         USB_CR_EP0_OUT_CMD_CLR
#define USB_CR_EP0_OUT_CMD_CLR_POS     (8U)
#define USB_CR_EP0_OUT_CMD_CLR_LEN     (1U)
#define USB_CR_EP0_OUT_CMD_CLR_MSK     (((1U << USB_CR_EP0_OUT_CMD_CLR_LEN) - 1) << USB_CR_EP0_OUT_CMD_CLR_POS)
#define USB_CR_EP0_OUT_CMD_CLR_UMSK    (~(((1U << USB_CR_EP0_OUT_CMD_CLR_LEN) - 1) << USB_CR_EP0_OUT_CMD_CLR_POS))
#define USB_CR_EP0_OUT_DONE_CLR        USB_CR_EP0_OUT_DONE_CLR
#define USB_CR_EP0_OUT_DONE_CLR_POS    (9U)
#define USB_CR_EP0_OUT_DONE_CLR_LEN    (1U)
#define USB_CR_EP0_OUT_DONE_CLR_MSK    (((1U << USB_CR_EP0_OUT_DONE_CLR_LEN) - 1) << USB_CR_EP0_OUT_DONE_CLR_POS)
#define USB_CR_EP0_OUT_DONE_CLR_UMSK   (~(((1U << USB_CR_EP0_OUT_DONE_CLR_LEN) - 1) << USB_CR_EP0_OUT_DONE_CLR_POS))
#define USB_CR_EP1_CMD_CLR             USB_CR_EP1_CMD_CLR
#define USB_CR_EP1_CMD_CLR_POS         (10U)
#define USB_CR_EP1_CMD_CLR_LEN         (1U)
#define USB_CR_EP1_CMD_CLR_MSK         (((1U << USB_CR_EP1_CMD_CLR_LEN) - 1) << USB_CR_EP1_CMD_CLR_POS)
#define USB_CR_EP1_CMD_CLR_UMSK        (~(((1U << USB_CR_EP1_CMD_CLR_LEN) - 1) << USB_CR_EP1_CMD_CLR_POS))
#define USB_CR_EP1_DONE_CLR            USB_CR_EP1_DONE_CLR
#define USB_CR_EP1_DONE_CLR_POS        (11U)
#define USB_CR_EP1_DONE_CLR_LEN        (1U)
#define USB_CR_EP1_DONE_CLR_MSK        (((1U << USB_CR_EP1_DONE_CLR_LEN) - 1) << USB_CR_EP1_DONE_CLR_POS)
#define USB_CR_EP1_DONE_CLR_UMSK       (~(((1U << USB_CR_EP1_DONE_CLR_LEN) - 1) << USB_CR_EP1_DONE_CLR_POS))
#define USB_CR_EP2_CMD_CLR             USB_CR_EP2_CMD_CLR
#define USB_CR_EP2_CMD_CLR_POS         (12U)
#define USB_CR_EP2_CMD_CLR_LEN         (1U)
#define USB_CR_EP2_CMD_CLR_MSK         (((1U << USB_CR_EP2_CMD_CLR_LEN) - 1) << USB_CR_EP2_CMD_CLR_POS)
#define USB_CR_EP2_CMD_CLR_UMSK        (~(((1U << USB_CR_EP2_CMD_CLR_LEN) - 1) << USB_CR_EP2_CMD_CLR_POS))
#define USB_CR_EP2_DONE_CLR            USB_CR_EP2_DONE_CLR
#define USB_CR_EP2_DONE_CLR_POS        (13U)
#define USB_CR_EP2_DONE_CLR_LEN        (1U)
#define USB_CR_EP2_DONE_CLR_MSK        (((1U << USB_CR_EP2_DONE_CLR_LEN) - 1) << USB_CR_EP2_DONE_CLR_POS)
#define USB_CR_EP2_DONE_CLR_UMSK       (~(((1U << USB_CR_EP2_DONE_CLR_LEN) - 1) << USB_CR_EP2_DONE_CLR_POS))
#define USB_CR_EP3_CMD_CLR             USB_CR_EP3_CMD_CLR
#define USB_CR_EP3_CMD_CLR_POS         (14U)
#define USB_CR_EP3_CMD_CLR_LEN         (1U)
#define USB_CR_EP3_CMD_CLR_MSK         (((1U << USB_CR_EP3_CMD_CLR_LEN) - 1) << USB_CR_EP3_CMD_CLR_POS)
#define USB_CR_EP3_CMD_CLR_UMSK        (~(((1U << USB_CR_EP3_CMD_CLR_LEN) - 1) << USB_CR_EP3_CMD_CLR_POS))
#define USB_CR_EP3_DONE_CLR            USB_CR_EP3_DONE_CLR
#define USB_CR_EP3_DONE_CLR_POS        (15U)
#define USB_CR_EP3_DONE_CLR_LEN        (1U)
#define USB_CR_EP3_DONE_CLR_MSK        (((1U << USB_CR_EP3_DONE_CLR_LEN) - 1) << USB_CR_EP3_DONE_CLR_POS)
#define USB_CR_EP3_DONE_CLR_UMSK       (~(((1U << USB_CR_EP3_DONE_CLR_LEN) - 1) << USB_CR_EP3_DONE_CLR_POS))
#define USB_CR_EP4_CMD_CLR             USB_CR_EP4_CMD_CLR
#define USB_CR_EP4_CMD_CLR_POS         (16U)
#define USB_CR_EP4_CMD_CLR_LEN         (1U)
#define USB_CR_EP4_CMD_CLR_MSK         (((1U << USB_CR_EP4_CMD_CLR_LEN) - 1) << USB_CR_EP4_CMD_CLR_POS)
#define USB_CR_EP4_CMD_CLR_UMSK        (~(((1U << USB_CR_EP4_CMD_CLR_LEN) - 1) << USB_CR_EP4_CMD_CLR_POS))
#define USB_CR_EP4_DONE_CLR            USB_CR_EP4_DONE_CLR
#define USB_CR_EP4_DONE_CLR_POS        (17U)
#define USB_CR_EP4_DONE_CLR_LEN        (1U)
#define USB_CR_EP4_DONE_CLR_MSK        (((1U << USB_CR_EP4_DONE_CLR_LEN) - 1) << USB_CR_EP4_DONE_CLR_POS)
#define USB_CR_EP4_DONE_CLR_UMSK       (~(((1U << USB_CR_EP4_DONE_CLR_LEN) - 1) << USB_CR_EP4_DONE_CLR_POS))
#define USB_CR_EP5_CMD_CLR             USB_CR_EP5_CMD_CLR
#define USB_CR_EP5_CMD_CLR_POS         (18U)
#define USB_CR_EP5_CMD_CLR_LEN         (1U)
#define USB_CR_EP5_CMD_CLR_MSK         (((1U << USB_CR_EP5_CMD_CLR_LEN) - 1) << USB_CR_EP5_CMD_CLR_POS)
#define USB_CR_EP5_CMD_CLR_UMSK        (~(((1U << USB_CR_EP5_CMD_CLR_LEN) - 1) << USB_CR_EP5_CMD_CLR_POS))
#define USB_CR_EP5_DONE_CLR            USB_CR_EP5_DONE_CLR
#define USB_CR_EP5_DONE_CLR_POS        (19U)
#define USB_CR_EP5_DONE_CLR_LEN        (1U)
#define USB_CR_EP5_DONE_CLR_MSK        (((1U << USB_CR_EP5_DONE_CLR_LEN) - 1) << USB_CR_EP5_DONE_CLR_POS)
#define USB_CR_EP5_DONE_CLR_UMSK       (~(((1U << USB_CR_EP5_DONE_CLR_LEN) - 1) << USB_CR_EP5_DONE_CLR_POS))
#define USB_CR_EP6_CMD_CLR             USB_CR_EP6_CMD_CLR
#define USB_CR_EP6_CMD_CLR_POS         (20U)
#define USB_CR_EP6_CMD_CLR_LEN         (1U)
#define USB_CR_EP6_CMD_CLR_MSK         (((1U << USB_CR_EP6_CMD_CLR_LEN) - 1) << USB_CR_EP6_CMD_CLR_POS)
#define USB_CR_EP6_CMD_CLR_UMSK        (~(((1U << USB_CR_EP6_CMD_CLR_LEN) - 1) << USB_CR_EP6_CMD_CLR_POS))
#define USB_CR_EP6_DONE_CLR            USB_CR_EP6_DONE_CLR
#define USB_CR_EP6_DONE_CLR_POS        (21U)
#define USB_CR_EP6_DONE_CLR_LEN        (1U)
#define USB_CR_EP6_DONE_CLR_MSK        (((1U << USB_CR_EP6_DONE_CLR_LEN) - 1) << USB_CR_EP6_DONE_CLR_POS)
#define USB_CR_EP6_DONE_CLR_UMSK       (~(((1U << USB_CR_EP6_DONE_CLR_LEN) - 1) << USB_CR_EP6_DONE_CLR_POS))
#define USB_CR_EP7_CMD_CLR             USB_CR_EP7_CMD_CLR
#define USB_CR_EP7_CMD_CLR_POS         (22U)
#define USB_CR_EP7_CMD_CLR_LEN         (1U)
#define USB_CR_EP7_CMD_CLR_MSK         (((1U << USB_CR_EP7_CMD_CLR_LEN) - 1) << USB_CR_EP7_CMD_CLR_POS)
#define USB_CR_EP7_CMD_CLR_UMSK        (~(((1U << USB_CR_EP7_CMD_CLR_LEN) - 1) << USB_CR_EP7_CMD_CLR_POS))
#define USB_CR_EP7_DONE_CLR            USB_CR_EP7_DONE_CLR
#define USB_CR_EP7_DONE_CLR_POS        (23U)
#define USB_CR_EP7_DONE_CLR_LEN        (1U)
#define USB_CR_EP7_DONE_CLR_MSK        (((1U << USB_CR_EP7_DONE_CLR_LEN) - 1) << USB_CR_EP7_DONE_CLR_POS)
#define USB_CR_EP7_DONE_CLR_UMSK       (~(((1U << USB_CR_EP7_DONE_CLR_LEN) - 1) << USB_CR_EP7_DONE_CLR_POS))
#define USB_CR_USB_REND_CLR            USB_CR_USB_REND_CLR
#define USB_CR_USB_REND_CLR_POS        (27U)
#define USB_CR_USB_REND_CLR_LEN        (1U)
#define USB_CR_USB_REND_CLR_MSK        (((1U << USB_CR_USB_REND_CLR_LEN) - 1) << USB_CR_USB_REND_CLR_POS)
#define USB_CR_USB_REND_CLR_UMSK       (~(((1U << USB_CR_USB_REND_CLR_LEN) - 1) << USB_CR_USB_REND_CLR_POS))
#define USB_CR_LPM_WKUP_CLR            USB_CR_LPM_WKUP_CLR
#define USB_CR_LPM_WKUP_CLR_POS        (28U)
#define USB_CR_LPM_WKUP_CLR_LEN        (1U)
#define USB_CR_LPM_WKUP_CLR_MSK        (((1U << USB_CR_LPM_WKUP_CLR_LEN) - 1) << USB_CR_LPM_WKUP_CLR_POS)
#define USB_CR_LPM_WKUP_CLR_UMSK       (~(((1U << USB_CR_LPM_WKUP_CLR_LEN) - 1) << USB_CR_LPM_WKUP_CLR_POS))
#define USB_CR_LPM_PKT_CLR             USB_CR_LPM_PKT_CLR
#define USB_CR_LPM_PKT_CLR_POS         (29U)
#define USB_CR_LPM_PKT_CLR_LEN         (1U)
#define USB_CR_LPM_PKT_CLR_MSK         (((1U << USB_CR_LPM_PKT_CLR_LEN) - 1) << USB_CR_LPM_PKT_CLR_POS)
#define USB_CR_LPM_PKT_CLR_UMSK        (~(((1U << USB_CR_LPM_PKT_CLR_LEN) - 1) << USB_CR_LPM_PKT_CLR_POS))
#define USB_CR_SOF_3MS_CLR             USB_CR_SOF_3MS_CLR
#define USB_CR_SOF_3MS_CLR_POS         (30U)
#define USB_CR_SOF_3MS_CLR_LEN         (1U)
#define USB_CR_SOF_3MS_CLR_MSK         (((1U << USB_CR_SOF_3MS_CLR_LEN) - 1) << USB_CR_SOF_3MS_CLR_POS)
#define USB_CR_SOF_3MS_CLR_UMSK        (~(((1U << USB_CR_SOF_3MS_CLR_LEN) - 1) << USB_CR_SOF_3MS_CLR_POS))
#define USB_CR_USB_ERR_CLR             USB_CR_USB_ERR_CLR
#define USB_CR_USB_ERR_CLR_POS         (31U)
#define USB_CR_USB_ERR_CLR_LEN         (1U)
#define USB_CR_USB_ERR_CLR_MSK         (((1U << USB_CR_USB_ERR_CLR_LEN) - 1) << USB_CR_USB_ERR_CLR_POS)
#define USB_CR_USB_ERR_CLR_UMSK        (~(((1U << USB_CR_USB_ERR_CLR_LEN) - 1) << USB_CR_USB_ERR_CLR_POS))

/* 0x40 : ep1_config */
#define USB_EP1_CONFIG_OFFSET (0x40)
#define USB_CR_EP1_SIZE       USB_CR_EP1_SIZE
#define USB_CR_EP1_SIZE_POS   (0U)
#define USB_CR_EP1_SIZE_LEN   (11U)
#define USB_CR_EP1_SIZE_MSK   (((1U << USB_CR_EP1_SIZE_LEN) - 1) << USB_CR_EP1_SIZE_POS)
#define USB_CR_EP1_SIZE_UMSK  (~(((1U << USB_CR_EP1_SIZE_LEN) - 1) << USB_CR_EP1_SIZE_POS))
#define USB_CR_EP1_DIR        USB_CR_EP1_DIR
#define USB_CR_EP1_DIR_POS    (11U)
#define USB_CR_EP1_DIR_LEN    (2U)
#define USB_CR_EP1_DIR_MSK    (((1U << USB_CR_EP1_DIR_LEN) - 1) << USB_CR_EP1_DIR_POS)
#define USB_CR_EP1_DIR_UMSK   (~(((1U << USB_CR_EP1_DIR_LEN) - 1) << USB_CR_EP1_DIR_POS))
#define USB_CR_EP1_TYPE       USB_CR_EP1_TYPE
#define USB_CR_EP1_TYPE_POS   (13U)
#define USB_CR_EP1_TYPE_LEN   (3U)
#define USB_CR_EP1_TYPE_MSK   (((1U << USB_CR_EP1_TYPE_LEN) - 1) << USB_CR_EP1_TYPE_POS)
#define USB_CR_EP1_TYPE_UMSK  (~(((1U << USB_CR_EP1_TYPE_LEN) - 1) << USB_CR_EP1_TYPE_POS))
#define USB_CR_EP1_STALL      USB_CR_EP1_STALL
#define USB_CR_EP1_STALL_POS  (16U)
#define USB_CR_EP1_STALL_LEN  (1U)
#define USB_CR_EP1_STALL_MSK  (((1U << USB_CR_EP1_STALL_LEN) - 1) << USB_CR_EP1_STALL_POS)
#define USB_CR_EP1_STALL_UMSK (~(((1U << USB_CR_EP1_STALL_LEN) - 1) << USB_CR_EP1_STALL_POS))
#define USB_CR_EP1_NACK       USB_CR_EP1_NACK
#define USB_CR_EP1_NACK_POS   (17U)
#define USB_CR_EP1_NACK_LEN   (1U)
#define USB_CR_EP1_NACK_MSK   (((1U << USB_CR_EP1_NACK_LEN) - 1) << USB_CR_EP1_NACK_POS)
#define USB_CR_EP1_NACK_UMSK  (~(((1U << USB_CR_EP1_NACK_LEN) - 1) << USB_CR_EP1_NACK_POS))
#define USB_CR_EP1_RDY        USB_CR_EP1_RDY
#define USB_CR_EP1_RDY_POS    (18U)
#define USB_CR_EP1_RDY_LEN    (1U)
#define USB_CR_EP1_RDY_MSK    (((1U << USB_CR_EP1_RDY_LEN) - 1) << USB_CR_EP1_RDY_POS)
#define USB_CR_EP1_RDY_UMSK   (~(((1U << USB_CR_EP1_RDY_LEN) - 1) << USB_CR_EP1_RDY_POS))
#define USB_STS_EP1_RDY       USB_STS_EP1_RDY
#define USB_STS_EP1_RDY_POS   (19U)
#define USB_STS_EP1_RDY_LEN   (1U)
#define USB_STS_EP1_RDY_MSK   (((1U << USB_STS_EP1_RDY_LEN) - 1) << USB_STS_EP1_RDY_POS)
#define USB_STS_EP1_RDY_UMSK  (~(((1U << USB_STS_EP1_RDY_LEN) - 1) << USB_STS_EP1_RDY_POS))

/* 0x44 : ep2_config */
#define USB_EP2_CONFIG_OFFSET (0x44)
#define USB_CR_EP2_SIZE       USB_CR_EP2_SIZE
#define USB_CR_EP2_SIZE_POS   (0U)
#define USB_CR_EP2_SIZE_LEN   (11U)
#define USB_CR_EP2_SIZE_MSK   (((1U << USB_CR_EP2_SIZE_LEN) - 1) << USB_CR_EP2_SIZE_POS)
#define USB_CR_EP2_SIZE_UMSK  (~(((1U << USB_CR_EP2_SIZE_LEN) - 1) << USB_CR_EP2_SIZE_POS))
#define USB_CR_EP2_DIR        USB_CR_EP2_DIR
#define USB_CR_EP2_DIR_POS    (11U)
#define USB_CR_EP2_DIR_LEN    (2U)
#define USB_CR_EP2_DIR_MSK    (((1U << USB_CR_EP2_DIR_LEN) - 1) << USB_CR_EP2_DIR_POS)
#define USB_CR_EP2_DIR_UMSK   (~(((1U << USB_CR_EP2_DIR_LEN) - 1) << USB_CR_EP2_DIR_POS))
#define USB_CR_EP2_TYPE       USB_CR_EP2_TYPE
#define USB_CR_EP2_TYPE_POS   (13U)
#define USB_CR_EP2_TYPE_LEN   (3U)
#define USB_CR_EP2_TYPE_MSK   (((1U << USB_CR_EP2_TYPE_LEN) - 1) << USB_CR_EP2_TYPE_POS)
#define USB_CR_EP2_TYPE_UMSK  (~(((1U << USB_CR_EP2_TYPE_LEN) - 1) << USB_CR_EP2_TYPE_POS))
#define USB_CR_EP2_STALL      USB_CR_EP2_STALL
#define USB_CR_EP2_STALL_POS  (16U)
#define USB_CR_EP2_STALL_LEN  (1U)
#define USB_CR_EP2_STALL_MSK  (((1U << USB_CR_EP2_STALL_LEN) - 1) << USB_CR_EP2_STALL_POS)
#define USB_CR_EP2_STALL_UMSK (~(((1U << USB_CR_EP2_STALL_LEN) - 1) << USB_CR_EP2_STALL_POS))
#define USB_CR_EP2_NACK       USB_CR_EP2_NACK
#define USB_CR_EP2_NACK_POS   (17U)
#define USB_CR_EP2_NACK_LEN   (1U)
#define USB_CR_EP2_NACK_MSK   (((1U << USB_CR_EP2_NACK_LEN) - 1) << USB_CR_EP2_NACK_POS)
#define USB_CR_EP2_NACK_UMSK  (~(((1U << USB_CR_EP2_NACK_LEN) - 1) << USB_CR_EP2_NACK_POS))
#define USB_CR_EP2_RDY        USB_CR_EP2_RDY
#define USB_CR_EP2_RDY_POS    (18U)
#define USB_CR_EP2_RDY_LEN    (1U)
#define USB_CR_EP2_RDY_MSK    (((1U << USB_CR_EP2_RDY_LEN) - 1) << USB_CR_EP2_RDY_POS)
#define USB_CR_EP2_RDY_UMSK   (~(((1U << USB_CR_EP2_RDY_LEN) - 1) << USB_CR_EP2_RDY_POS))
#define USB_STS_EP2_RDY       USB_STS_EP2_RDY
#define USB_STS_EP2_RDY_POS   (19U)
#define USB_STS_EP2_RDY_LEN   (1U)
#define USB_STS_EP2_RDY_MSK   (((1U << USB_STS_EP2_RDY_LEN) - 1) << USB_STS_EP2_RDY_POS)
#define USB_STS_EP2_RDY_UMSK  (~(((1U << USB_STS_EP2_RDY_LEN) - 1) << USB_STS_EP2_RDY_POS))

