Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/usb_reg.h
/* 0x174 : ep7_fifo_status */
#define USB_EP7_FIFO_STATUS_OFFSET (0x174)
#define USB_EP7_TX_FIFO_CNT        USB_EP7_TX_FIFO_CNT
#define USB_EP7_TX_FIFO_CNT_POS    (0U)
#define USB_EP7_TX_FIFO_CNT_LEN    (7U)
#define USB_EP7_TX_FIFO_CNT_MSK    (((1U << USB_EP7_TX_FIFO_CNT_LEN) - 1) << USB_EP7_TX_FIFO_CNT_POS)
#define USB_EP7_TX_FIFO_CNT_UMSK   (~(((1U << USB_EP7_TX_FIFO_CNT_LEN) - 1) << USB_EP7_TX_FIFO_CNT_POS))
#define USB_EP7_TX_FIFO_EMPTY      USB_EP7_TX_FIFO_EMPTY
#define USB_EP7_TX_FIFO_EMPTY_POS  (14U)
#define USB_EP7_TX_FIFO_EMPTY_LEN  (1U)
#define USB_EP7_TX_FIFO_EMPTY_MSK  (((1U << USB_EP7_TX_FIFO_EMPTY_LEN) - 1) << USB_EP7_TX_FIFO_EMPTY_POS)
#define USB_EP7_TX_FIFO_EMPTY_UMSK (~(((1U << USB_EP7_TX_FIFO_EMPTY_LEN) - 1) << USB_EP7_TX_FIFO_EMPTY_POS))
#define USB_EP7_TX_FIFO_FULL       USB_EP7_TX_FIFO_FULL
#define USB_EP7_TX_FIFO_FULL_POS   (15U)
#define USB_EP7_TX_FIFO_FULL_LEN   (1U)
#define USB_EP7_TX_FIFO_FULL_MSK   (((1U << USB_EP7_TX_FIFO_FULL_LEN) - 1) << USB_EP7_TX_FIFO_FULL_POS)
#define USB_EP7_TX_FIFO_FULL_UMSK  (~(((1U << USB_EP7_TX_FIFO_FULL_LEN) - 1) << USB_EP7_TX_FIFO_FULL_POS))
#define USB_EP7_RX_FIFO_CNT        USB_EP7_RX_FIFO_CNT
#define USB_EP7_RX_FIFO_CNT_POS    (16U)
#define USB_EP7_RX_FIFO_CNT_LEN    (7U)
#define USB_EP7_RX_FIFO_CNT_MSK    (((1U << USB_EP7_RX_FIFO_CNT_LEN) - 1) << USB_EP7_RX_FIFO_CNT_POS)
#define USB_EP7_RX_FIFO_CNT_UMSK   (~(((1U << USB_EP7_RX_FIFO_CNT_LEN) - 1) << USB_EP7_RX_FIFO_CNT_POS))
#define USB_EP7_RX_FIFO_EMPTY      USB_EP7_RX_FIFO_EMPTY
#define USB_EP7_RX_FIFO_EMPTY_POS  (30U)
#define USB_EP7_RX_FIFO_EMPTY_LEN  (1U)
#define USB_EP7_RX_FIFO_EMPTY_MSK  (((1U << USB_EP7_RX_FIFO_EMPTY_LEN) - 1) << USB_EP7_RX_FIFO_EMPTY_POS)
#define USB_EP7_RX_FIFO_EMPTY_UMSK (~(((1U << USB_EP7_RX_FIFO_EMPTY_LEN) - 1) << USB_EP7_RX_FIFO_EMPTY_POS))
#define USB_EP7_RX_FIFO_FULL       USB_EP7_RX_FIFO_FULL
#define USB_EP7_RX_FIFO_FULL_POS   (31U)
#define USB_EP7_RX_FIFO_FULL_LEN   (1U)
#define USB_EP7_RX_FIFO_FULL_MSK   (((1U << USB_EP7_RX_FIFO_FULL_LEN) - 1) << USB_EP7_RX_FIFO_FULL_POS)
#define USB_EP7_RX_FIFO_FULL_UMSK  (~(((1U << USB_EP7_RX_FIFO_FULL_LEN) - 1) << USB_EP7_RX_FIFO_FULL_POS))

/* 0x178 : ep7_tx_fifo_wdata */
#define USB_EP7_TX_FIFO_WDATA_OFFSET (0x178)
#define USB_EP7_TX_FIFO_WDATA        USB_EP7_TX_FIFO_WDATA
#define USB_EP7_TX_FIFO_WDATA_POS    (0U)
#define USB_EP7_TX_FIFO_WDATA_LEN    (8U)
#define USB_EP7_TX_FIFO_WDATA_MSK    (((1U << USB_EP7_TX_FIFO_WDATA_LEN) - 1) << USB_EP7_TX_FIFO_WDATA_POS)
#define USB_EP7_TX_FIFO_WDATA_UMSK   (~(((1U << USB_EP7_TX_FIFO_WDATA_LEN) - 1) << USB_EP7_TX_FIFO_WDATA_POS))

/* 0x17C : ep7_rx_fifo_rdata */
#define USB_EP7_RX_FIFO_RDATA_OFFSET (0x17C)
#define USB_EP7_RX_FIFO_RDATA        USB_EP7_RX_FIFO_RDATA
#define USB_EP7_RX_FIFO_RDATA_POS    (0U)
#define USB_EP7_RX_FIFO_RDATA_LEN    (8U)
#define USB_EP7_RX_FIFO_RDATA_MSK    (((1U << USB_EP7_RX_FIFO_RDATA_LEN) - 1) << USB_EP7_RX_FIFO_RDATA_POS)
#define USB_EP7_RX_FIFO_RDATA_UMSK   (~(((1U << USB_EP7_RX_FIFO_RDATA_LEN) - 1) << USB_EP7_RX_FIFO_RDATA_POS))

/* 0x1F0 : rsvd_0 */
#define USB_RSVD_0_OFFSET (0x1F0)

/* 0x1F4 : rsvd_1 */
#define USB_RSVD_1_OFFSET (0x1F4)

/* 0x1FC : xcvr_if_config */
#define USB_XCVR_IF_CONFIG_OFFSET    (0x1FC)
#define USB_CR_XCVR_FORCE_TX_EN      USB_CR_XCVR_FORCE_TX_EN
#define USB_CR_XCVR_FORCE_TX_EN_POS  (0U)
#define USB_CR_XCVR_FORCE_TX_EN_LEN  (1U)
#define USB_CR_XCVR_FORCE_TX_EN_MSK  (((1U << USB_CR_XCVR_FORCE_TX_EN_LEN) - 1) << USB_CR_XCVR_FORCE_TX_EN_POS)
#define USB_CR_XCVR_FORCE_TX_EN_UMSK (~(((1U << USB_CR_XCVR_FORCE_TX_EN_LEN) - 1) << USB_CR_XCVR_FORCE_TX_EN_POS))
#define USB_CR_XCVR_FORCE_TX_OE      USB_CR_XCVR_FORCE_TX_OE
#define USB_CR_XCVR_FORCE_TX_OE_POS  (1U)
#define USB_CR_XCVR_FORCE_TX_OE_LEN  (1U)
#define USB_CR_XCVR_FORCE_TX_OE_MSK  (((1U << USB_CR_XCVR_FORCE_TX_OE_LEN) - 1) << USB_CR_XCVR_FORCE_TX_OE_POS)
#define USB_CR_XCVR_FORCE_TX_OE_UMSK (~(((1U << USB_CR_XCVR_FORCE_TX_OE_LEN) - 1) << USB_CR_XCVR_FORCE_TX_OE_POS))
#define USB_CR_XCVR_FORCE_TX_DP      USB_CR_XCVR_FORCE_TX_DP
#define USB_CR_XCVR_FORCE_TX_DP_POS  (2U)
#define USB_CR_XCVR_FORCE_TX_DP_LEN  (1U)
#define USB_CR_XCVR_FORCE_TX_DP_MSK  (((1U << USB_CR_XCVR_FORCE_TX_DP_LEN) - 1) << USB_CR_XCVR_FORCE_TX_DP_POS)
#define USB_CR_XCVR_FORCE_TX_DP_UMSK (~(((1U << USB_CR_XCVR_FORCE_TX_DP_LEN) - 1) << USB_CR_XCVR_FORCE_TX_DP_POS))
#define USB_CR_XCVR_FORCE_TX_DN      USB_CR_XCVR_FORCE_TX_DN
#define USB_CR_XCVR_FORCE_TX_DN_POS  (3U)
#define USB_CR_XCVR_FORCE_TX_DN_LEN  (1U)
#define USB_CR_XCVR_FORCE_TX_DN_MSK  (((1U << USB_CR_XCVR_FORCE_TX_DN_LEN) - 1) << USB_CR_XCVR_FORCE_TX_DN_POS)
#define USB_CR_XCVR_FORCE_TX_DN_UMSK (~(((1U << USB_CR_XCVR_FORCE_TX_DN_LEN) - 1) << USB_CR_XCVR_FORCE_TX_DN_POS))
#define USB_CR_XCVR_FORCE_RX_EN      USB_CR_XCVR_FORCE_RX_EN
#define USB_CR_XCVR_FORCE_RX_EN_POS  (4U)
#define USB_CR_XCVR_FORCE_RX_EN_LEN  (1U)
#define USB_CR_XCVR_FORCE_RX_EN_MSK  (((1U << USB_CR_XCVR_FORCE_RX_EN_LEN) - 1) << USB_CR_XCVR_FORCE_RX_EN_POS)
#define USB_CR_XCVR_FORCE_RX_EN_UMSK (~(((1U << USB_CR_XCVR_FORCE_RX_EN_LEN) - 1) << USB_CR_XCVR_FORCE_RX_EN_POS))
#define USB_CR_XCVR_FORCE_RX_D       USB_CR_XCVR_FORCE_RX_D
#define USB_CR_XCVR_FORCE_RX_D_POS   (5U)
#define USB_CR_XCVR_FORCE_RX_D_LEN   (1U)
#define USB_CR_XCVR_FORCE_RX_D_MSK   (((1U << USB_CR_XCVR_FORCE_RX_D_LEN) - 1) << USB_CR_XCVR_FORCE_RX_D_POS)
#define USB_CR_XCVR_FORCE_RX_D_UMSK  (~(((1U << USB_CR_XCVR_FORCE_RX_D_LEN) - 1) << USB_CR_XCVR_FORCE_RX_D_POS))
#define USB_CR_XCVR_FORCE_RX_DP      USB_CR_XCVR_FORCE_RX_DP
#define USB_CR_XCVR_FORCE_RX_DP_POS  (6U)
#define USB_CR_XCVR_FORCE_RX_DP_LEN  (1U)
#define USB_CR_XCVR_FORCE_RX_DP_MSK  (((1U << USB_CR_XCVR_FORCE_RX_DP_LEN) - 1) << USB_CR_XCVR_FORCE_RX_DP_POS)
#define USB_CR_XCVR_FORCE_RX_DP_UMSK (~(((1U << USB_CR_XCVR_FORCE_RX_DP_LEN) - 1) << USB_CR_XCVR_FORCE_RX_DP_POS))
#define USB_CR_XCVR_FORCE_RX_DN      USB_CR_XCVR_FORCE_RX_DN
#define USB_CR_XCVR_FORCE_RX_DN_POS  (7U)
#define USB_CR_XCVR_FORCE_RX_DN_LEN  (1U)
#define USB_CR_XCVR_FORCE_RX_DN_MSK  (((1U << USB_CR_XCVR_FORCE_RX_DN_LEN) - 1) << USB_CR_XCVR_FORCE_RX_DN_POS)
#define USB_CR_XCVR_FORCE_RX_DN_UMSK (~(((1U << USB_CR_XCVR_FORCE_RX_DN_LEN) - 1) << USB_CR_XCVR_FORCE_RX_DN_POS))
#define USB_CR_XCVR_OM_RX_SEL        USB_CR_XCVR_OM_RX_SEL
#define USB_CR_XCVR_OM_RX_SEL_POS    (8U)
#define USB_CR_XCVR_OM_RX_SEL_LEN    (1U)
#define USB_CR_XCVR_OM_RX_SEL_MSK    (((1U << USB_CR_XCVR_OM_RX_SEL_LEN) - 1) << USB_CR_XCVR_OM_RX_SEL_POS)
#define USB_CR_XCVR_OM_RX_SEL_UMSK   (~(((1U << USB_CR_XCVR_OM_RX_SEL_LEN) - 1) << USB_CR_XCVR_OM_RX_SEL_POS))
#define USB_CR_XCVR_OM_RX_D          USB_CR_XCVR_OM_RX_D
#define USB_CR_XCVR_OM_RX_D_POS      (9U)
#define USB_CR_XCVR_OM_RX_D_LEN      (1U)
#define USB_CR_XCVR_OM_RX_D_MSK      (((1U << USB_CR_XCVR_OM_RX_D_LEN) - 1) << USB_CR_XCVR_OM_RX_D_POS)
#define USB_CR_XCVR_OM_RX_D_UMSK     (~(((1U << USB_CR_XCVR_OM_RX_D_LEN) - 1) << USB_CR_XCVR_OM_RX_D_POS))
#define USB_CR_XCVR_OM_RX_DP         USB_CR_XCVR_OM_RX_DP
#define USB_CR_XCVR_OM_RX_DP_POS     (10U)
#define USB_CR_XCVR_OM_RX_DP_LEN     (1U)
#define USB_CR_XCVR_OM_RX_DP_MSK     (((1U << USB_CR_XCVR_OM_RX_DP_LEN) - 1) << USB_CR_XCVR_OM_RX_DP_POS)
#define USB_CR_XCVR_OM_RX_DP_UMSK    (~(((1U << USB_CR_XCVR_OM_RX_DP_LEN) - 1) << USB_CR_XCVR_OM_RX_DP_POS))
#define USB_CR_XCVR_OM_RX_DN         USB_CR_XCVR_OM_RX_DN
#define USB_CR_XCVR_OM_RX_DN_POS     (11U)
#define USB_CR_XCVR_OM_RX_DN_LEN     (1U)
#define USB_CR_XCVR_OM_RX_DN_MSK     (((1U << USB_CR_XCVR_OM_RX_DN_LEN) - 1) << USB_CR_XCVR_OM_RX_DN_POS)
#define USB_CR_XCVR_OM_RX_DN_UMSK    (~(((1U << USB_CR_XCVR_OM_RX_DN_LEN) - 1) << USB_CR_XCVR_OM_RX_DN_POS))
#define USB_STS_VBUS_DET             USB_STS_VBUS_DET
#define USB_STS_VBUS_DET_POS         (31U)
#define USB_STS_VBUS_DET_LEN         (1U)
#define USB_STS_VBUS_DET_MSK         (((1U << USB_STS_VBUS_DET_LEN) - 1) << USB_STS_VBUS_DET_POS)
#define USB_STS_VBUS_DET_UMSK        (~(((1U << USB_STS_VBUS_DET_LEN) - 1) << USB_STS_VBUS_DET_POS))

struct usb_reg {
    /* 0x0 : usb_config */
    union {
        struct
        {
            uint32_t cr_usb_en              : 1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3           : 3; /* [ 3: 1],       rsvd,        0x0 */
            uint32_t cr_usb_rom_dct_en      : 1; /* [    4],        r/w,        0x1 */
            uint32_t reserved_5_7           : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t cr_usb_ep0_sw_ctrl     : 1; /* [    8],        r/w,        0x0 */
            uint32_t cr_usb_ep0_sw_addr     : 7; /* [15: 9],        r/w,        0x0 */
            uint32_t cr_usb_ep0_sw_size     : 8; /* [23:16],        r/w,        0x0 */
            uint32_t cr_usb_ep0_sw_stall    : 1; /* [   24],        w1c,        0x0 */
            uint32_t cr_usb_ep0_sw_nack_in  : 1; /* [   25],        r/w,        0x1 */
            uint32_t cr_usb_ep0_sw_nack_out : 1; /* [   26],        r/w,        0x0 */
            uint32_t cr_usb_ep0_sw_rdy      : 1; /* [   27],        w1c,        0x0 */
            uint32_t sts_usb_ep0_sw_rdy     : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29_31         : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } usb_config;

    /* 0x4 : usb_lpm_config */
    union {
        struct
        {
            uint32_t cr_lpm_en       : 1;  /* [    0],        w1c,        0x0 */
            uint32_t cr_lpm_resp_upd : 1;  /* [    1],        w1c,        0x0 */
            uint32_t cr_lpm_resp     : 2;  /* [ 3: 2],        r/w,        0x2 */
            uint32_t reserved_4_19   : 16; /* [19: 4],       rsvd,        0x0 */
            uint32_t sts_lpm_attr    : 11; /* [30:20],          r,        0x0 */
            uint32_t sts_lpm         : 1;  /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } usb_lpm_config;

    /* 0x8 : usb_resume_config */
    union {
        struct
        {
            uint32_t cr_res_width   : 11; /* [10: 0],        r/w,       0x1a */
            uint32_t reserved_11    : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t cr_res_trig    : 1;  /* [   12],        w1c,        0x0 */
            uint32_t reserved_13_30 : 18; /* [30:13],       rsvd,        0x0 */
            uint32_t cr_res_force   : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } usb_resume_config;

