Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/usb_reg.h
    /* 0x2C : USB interrupt clear */
    union {
        struct
        {
            uint32_t cr_sof_clr            : 1; /* [    0],        w1c,        0x0 */
            uint32_t cr_usb_reset_clr      : 1; /* [    1],        w1c,        0x0 */
            uint32_t cr_vbus_tgl_clr       : 1; /* [    2],        w1c,        0x0 */
            uint32_t cr_get_dct_cmd_clr    : 1; /* [    3],        w1c,        0x0 */
            uint32_t cr_ep0_setup_cmd_clr  : 1; /* [    4],        w1c,        0x0 */
            uint32_t cr_ep0_setup_done_clr : 1; /* [    5],        w1c,        0x0 */
            uint32_t cr_ep0_in_cmd_clr     : 1; /* [    6],        w1c,        0x0 */
            uint32_t cr_ep0_in_done_clr    : 1; /* [    7],        w1c,        0x0 */
            uint32_t cr_ep0_out_cmd_clr    : 1; /* [    8],        w1c,        0x0 */
            uint32_t cr_ep0_out_done_clr   : 1; /* [    9],        w1c,        0x0 */
            uint32_t cr_ep1_cmd_clr        : 1; /* [   10],        w1c,        0x0 */
            uint32_t cr_ep1_done_clr       : 1; /* [   11],        w1c,        0x0 */
            uint32_t cr_ep2_cmd_clr        : 1; /* [   12],        w1c,        0x0 */
            uint32_t cr_ep2_done_clr       : 1; /* [   13],        w1c,        0x0 */
            uint32_t cr_ep3_cmd_clr        : 1; /* [   14],        w1c,        0x0 */
            uint32_t cr_ep3_done_clr       : 1; /* [   15],        w1c,        0x0 */
            uint32_t cr_ep4_cmd_clr        : 1; /* [   16],        w1c,        0x0 */
            uint32_t cr_ep4_done_clr       : 1; /* [   17],        w1c,        0x0 */
            uint32_t cr_ep5_cmd_clr        : 1; /* [   18],        w1c,        0x0 */
            uint32_t cr_ep5_done_clr       : 1; /* [   19],        w1c,        0x0 */
            uint32_t cr_ep6_cmd_clr        : 1; /* [   20],        w1c,        0x0 */
            uint32_t cr_ep6_done_clr       : 1; /* [   21],        w1c,        0x0 */
            uint32_t cr_ep7_cmd_clr        : 1; /* [   22],        w1c,        0x0 */
            uint32_t cr_ep7_done_clr       : 1; /* [   23],        w1c,        0x0 */
            uint32_t rsvd_26_24            : 3; /* [26:24],       rsvd,        0x0 */
            uint32_t cr_usb_rend_clr       : 1; /* [   27],        w1c,        0x0 */
            uint32_t cr_lpm_wkup_clr       : 1; /* [   28],        w1c,        0x0 */
            uint32_t cr_lpm_pkt_clr        : 1; /* [   29],        w1c,        0x0 */
            uint32_t cr_sof_3ms_clr        : 1; /* [   30],        w1c,        0x0 */
            uint32_t cr_usb_err_clr        : 1; /* [   31],        w1c,        0x0 */
        } BF;
        uint32_t WORD;
    } usb_int_clear;

    /* 0x30  reserved */
    uint8_t RESERVED0x30[16];

    /* 0x40 : ep1_config */
    union {
        struct
        {
            uint32_t cr_ep1_size    : 11; /* [10: 0],        r/w,       0x40 */
            uint32_t cr_ep1_dir     : 2;  /* [12:11],        r/w,        0x1 */
            uint32_t cr_ep1_type    : 3;  /* [15:13],        r/w,        0x4 */
            uint32_t cr_ep1_stall   : 1;  /* [   16],        r/w,        0x0 */
            uint32_t cr_ep1_nack    : 1;  /* [   17],        r/w,        0x1 */
            uint32_t cr_ep1_rdy     : 1;  /* [   18],        w1c,        0x0 */
            uint32_t sts_ep1_rdy    : 1;  /* [   19],          r,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep1_config;

    /* 0x44 : ep2_config */
    union {
        struct
        {
            uint32_t cr_ep2_size    : 11; /* [10: 0],        r/w,       0x40 */
            uint32_t cr_ep2_dir     : 2;  /* [12:11],        r/w,        0x1 */
            uint32_t cr_ep2_type    : 3;  /* [15:13],        r/w,        0x4 */
            uint32_t cr_ep2_stall   : 1;  /* [   16],        r/w,        0x0 */
            uint32_t cr_ep2_nack    : 1;  /* [   17],        r/w,        0x1 */
            uint32_t cr_ep2_rdy     : 1;  /* [   18],        w1c,        0x0 */
            uint32_t sts_ep2_rdy    : 1;  /* [   19],          r,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep2_config;

    /* 0x48 : ep3_config */
    union {
        struct
        {
            uint32_t cr_ep3_size    : 11; /* [10: 0],        r/w,       0x40 */
            uint32_t cr_ep3_dir     : 2;  /* [12:11],        r/w,        0x1 */
            uint32_t cr_ep3_type    : 3;  /* [15:13],        r/w,        0x4 */
            uint32_t cr_ep3_stall   : 1;  /* [   16],        r/w,        0x0 */
            uint32_t cr_ep3_nack    : 1;  /* [   17],        r/w,        0x1 */
            uint32_t cr_ep3_rdy     : 1;  /* [   18],        w1c,        0x0 */
            uint32_t sts_ep3_rdy    : 1;  /* [   19],          r,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep3_config;

    /* 0x4C : ep4_config */
    union {
        struct
        {
            uint32_t cr_ep4_size    : 11; /* [10: 0],        r/w,       0x40 */
            uint32_t cr_ep4_dir     : 2;  /* [12:11],        r/w,        0x1 */
            uint32_t cr_ep4_type    : 3;  /* [15:13],        r/w,        0x4 */
            uint32_t cr_ep4_stall   : 1;  /* [   16],        r/w,        0x0 */
            uint32_t cr_ep4_nack    : 1;  /* [   17],        r/w,        0x1 */
            uint32_t cr_ep4_rdy     : 1;  /* [   18],        w1c,        0x0 */
            uint32_t sts_ep4_rdy    : 1;  /* [   19],          r,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep4_config;

    /* 0x50 : ep5_config */
    union {
        struct
        {
            uint32_t cr_ep5_size    : 11; /* [10: 0],        r/w,       0x40 */
            uint32_t cr_ep5_dir     : 2;  /* [12:11],        r/w,        0x1 */
            uint32_t cr_ep5_type    : 3;  /* [15:13],        r/w,        0x4 */
            uint32_t cr_ep5_stall   : 1;  /* [   16],        r/w,        0x0 */
            uint32_t cr_ep5_nack    : 1;  /* [   17],        r/w,        0x1 */
            uint32_t cr_ep5_rdy     : 1;  /* [   18],        w1c,        0x0 */
            uint32_t sts_ep5_rdy    : 1;  /* [   19],          r,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep5_config;

    /* 0x54 : ep6_config */
    union {
        struct
        {
            uint32_t cr_ep6_size    : 11; /* [10: 0],        r/w,       0x40 */
            uint32_t cr_ep6_dir     : 2;  /* [12:11],        r/w,        0x1 */
            uint32_t cr_ep6_type    : 3;  /* [15:13],        r/w,        0x4 */
            uint32_t cr_ep6_stall   : 1;  /* [   16],        r/w,        0x0 */
            uint32_t cr_ep6_nack    : 1;  /* [   17],        r/w,        0x1 */
            uint32_t cr_ep6_rdy     : 1;  /* [   18],        w1c,        0x0 */
            uint32_t sts_ep6_rdy    : 1;  /* [   19],          r,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep6_config;

    /* 0x58 : ep7_config */
    union {
        struct
        {
            uint32_t cr_ep7_size    : 11; /* [10: 0],        r/w,       0x40 */
            uint32_t cr_ep7_dir     : 2;  /* [12:11],        r/w,        0x1 */
            uint32_t cr_ep7_type    : 3;  /* [15:13],        r/w,        0x4 */
            uint32_t cr_ep7_stall   : 1;  /* [   16],        r/w,        0x0 */
            uint32_t cr_ep7_nack    : 1;  /* [   17],        r/w,        0x1 */
            uint32_t cr_ep7_rdy     : 1;  /* [   18],        w1c,        0x0 */
            uint32_t sts_ep7_rdy    : 1;  /* [   19],          r,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep7_config;

