Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/usb_reg.h
    /* 0x128 : ep2_tx_fifo_wdata */
    union {
        struct
        {
            uint32_t ep2_tx_fifo_wdata : 8;  /* [ 7: 0],          w,          x */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep2_tx_fifo_wdata;

    /* 0x12C : ep2_rx_fifo_rdata */
    union {
        struct
        {
            uint32_t ep2_rx_fifo_rdata : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep2_rx_fifo_rdata;

    /* 0x130 : ep3_fifo_config */
    union {
        struct
        {
            uint32_t ep3_dma_tx_en         : 1;  /* [    0],        r/w,        0x0 */
            uint32_t ep3_dma_rx_en         : 1;  /* [    1],        r/w,        0x0 */
            uint32_t ep3_tx_fifo_clr       : 1;  /* [    2],        w1c,        0x0 */
            uint32_t ep3_rx_fifo_clr       : 1;  /* [    3],        w1c,        0x0 */
            uint32_t ep3_tx_fifo_overflow  : 1;  /* [    4],          r,        0x0 */
            uint32_t ep3_tx_fifo_underflow : 1;  /* [    5],          r,        0x0 */
            uint32_t ep3_rx_fifo_overflow  : 1;  /* [    6],          r,        0x0 */
            uint32_t ep3_rx_fifo_underflow : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31         : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep3_fifo_config;

    /* 0x134 : ep3_fifo_status */
    union {
        struct
        {
            uint32_t ep3_tx_fifo_cnt   : 7; /* [ 6: 0],          r,       0x40 */
            uint32_t reserved_7_13     : 7; /* [13: 7],       rsvd,        0x0 */
            uint32_t ep3_tx_fifo_empty : 1; /* [   14],          r,        0x1 */
            uint32_t ep3_tx_fifo_full  : 1; /* [   15],          r,        0x0 */
            uint32_t ep3_rx_fifo_cnt   : 7; /* [22:16],          r,        0x0 */
            uint32_t reserved_23_29    : 7; /* [29:23],       rsvd,        0x0 */
            uint32_t ep3_rx_fifo_empty : 1; /* [   30],          r,        0x1 */
            uint32_t ep3_rx_fifo_full  : 1; /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } ep3_fifo_status;

    /* 0x138 : ep3_tx_fifo_wdata */
    union {
        struct
        {
            uint32_t ep3_tx_fifo_wdata : 8;  /* [ 7: 0],          w,          x */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep3_tx_fifo_wdata;

    /* 0x13C : ep3_rx_fifo_rdata */
    union {
        struct
        {
            uint32_t ep3_rx_fifo_rdata : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep3_rx_fifo_rdata;

    /* 0x140 : ep4_fifo_config */
    union {
        struct
        {
            uint32_t ep4_dma_tx_en         : 1;  /* [    0],        r/w,        0x0 */
            uint32_t ep4_dma_rx_en         : 1;  /* [    1],        r/w,        0x0 */
            uint32_t ep4_tx_fifo_clr       : 1;  /* [    2],        w1c,        0x0 */
            uint32_t ep4_rx_fifo_clr       : 1;  /* [    3],        w1c,        0x0 */
            uint32_t ep4_tx_fifo_overflow  : 1;  /* [    4],          r,        0x0 */
            uint32_t ep4_tx_fifo_underflow : 1;  /* [    5],          r,        0x0 */
            uint32_t ep4_rx_fifo_overflow  : 1;  /* [    6],          r,        0x0 */
            uint32_t ep4_rx_fifo_underflow : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31         : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep4_fifo_config;

    /* 0x144 : ep4_fifo_status */
    union {
        struct
        {
            uint32_t ep4_tx_fifo_cnt   : 7; /* [ 6: 0],          r,       0x40 */
            uint32_t reserved_7_13     : 7; /* [13: 7],       rsvd,        0x0 */
            uint32_t ep4_tx_fifo_empty : 1; /* [   14],          r,        0x1 */
            uint32_t ep4_tx_fifo_full  : 1; /* [   15],          r,        0x0 */
            uint32_t ep4_rx_fifo_cnt   : 7; /* [22:16],          r,        0x0 */
            uint32_t reserved_23_29    : 7; /* [29:23],       rsvd,        0x0 */
            uint32_t ep4_rx_fifo_empty : 1; /* [   30],          r,        0x1 */
            uint32_t ep4_rx_fifo_full  : 1; /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } ep4_fifo_status;

    /* 0x148 : ep4_tx_fifo_wdata */
    union {
        struct
        {
            uint32_t ep4_tx_fifo_wdata : 8;  /* [ 7: 0],          w,          x */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep4_tx_fifo_wdata;

    /* 0x14C : ep4_rx_fifo_rdata */
    union {
        struct
        {
            uint32_t ep4_rx_fifo_rdata : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep4_rx_fifo_rdata;

    /* 0x150 : ep5_fifo_config */
    union {
        struct
        {
            uint32_t ep5_dma_tx_en         : 1;  /* [    0],        r/w,        0x0 */
            uint32_t ep5_dma_rx_en         : 1;  /* [    1],        r/w,        0x0 */
            uint32_t ep5_tx_fifo_clr       : 1;  /* [    2],        w1c,        0x0 */
            uint32_t ep5_rx_fifo_clr       : 1;  /* [    3],        w1c,        0x0 */
            uint32_t ep5_tx_fifo_overflow  : 1;  /* [    4],          r,        0x0 */
            uint32_t ep5_tx_fifo_underflow : 1;  /* [    5],          r,        0x0 */
            uint32_t ep5_rx_fifo_overflow  : 1;  /* [    6],          r,        0x0 */
            uint32_t ep5_rx_fifo_underflow : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31         : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep5_fifo_config;

    /* 0x154 : ep5_fifo_status */
    union {
        struct
        {
            uint32_t ep5_tx_fifo_cnt   : 7; /* [ 6: 0],          r,       0x40 */
            uint32_t reserved_7_13     : 7; /* [13: 7],       rsvd,        0x0 */
            uint32_t ep5_tx_fifo_empty : 1; /* [   14],          r,        0x1 */
            uint32_t ep5_tx_fifo_full  : 1; /* [   15],          r,        0x0 */
            uint32_t ep5_rx_fifo_cnt   : 7; /* [22:16],          r,        0x0 */
            uint32_t reserved_23_29    : 7; /* [29:23],       rsvd,        0x0 */
            uint32_t ep5_rx_fifo_empty : 1; /* [   30],          r,        0x1 */
            uint32_t ep5_rx_fifo_full  : 1; /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } ep5_fifo_status;

