Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/usb_reg.h
    /* 0x158 : ep5_tx_fifo_wdata */
    union {
        struct
        {
            uint32_t ep5_tx_fifo_wdata : 8;  /* [ 7: 0],          w,          x */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep5_tx_fifo_wdata;

    /* 0x15C : ep5_rx_fifo_rdata */
    union {
        struct
        {
            uint32_t ep5_rx_fifo_rdata : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep5_rx_fifo_rdata;

    /* 0x160 : ep6_fifo_config */
    union {
        struct
        {
            uint32_t ep6_dma_tx_en         : 1;  /* [    0],        r/w,        0x0 */
            uint32_t ep6_dma_rx_en         : 1;  /* [    1],        r/w,        0x0 */
            uint32_t ep6_tx_fifo_clr       : 1;  /* [    2],        w1c,        0x0 */
            uint32_t ep6_rx_fifo_clr       : 1;  /* [    3],        w1c,        0x0 */
            uint32_t ep6_tx_fifo_overflow  : 1;  /* [    4],          r,        0x0 */
            uint32_t ep6_tx_fifo_underflow : 1;  /* [    5],          r,        0x0 */
            uint32_t ep6_rx_fifo_overflow  : 1;  /* [    6],          r,        0x0 */
            uint32_t ep6_rx_fifo_underflow : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31         : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep6_fifo_config;

    /* 0x164 : ep6_fifo_status */
    union {
        struct
        {
            uint32_t ep6_tx_fifo_cnt   : 7; /* [ 6: 0],          r,       0x40 */
            uint32_t reserved_7_13     : 7; /* [13: 7],       rsvd,        0x0 */
            uint32_t ep6_tx_fifo_empty : 1; /* [   14],          r,        0x1 */
            uint32_t ep6_tx_fifo_full  : 1; /* [   15],          r,        0x0 */
            uint32_t ep6_rx_fifo_cnt   : 7; /* [22:16],          r,        0x0 */
            uint32_t reserved_23_29    : 7; /* [29:23],       rsvd,        0x0 */
            uint32_t ep6_rx_fifo_empty : 1; /* [   30],          r,        0x1 */
            uint32_t ep6_rx_fifo_full  : 1; /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } ep6_fifo_status;

    /* 0x168 : ep6_tx_fifo_wdata */
    union {
        struct
        {
            uint32_t ep6_tx_fifo_wdata : 8;  /* [ 7: 0],          w,          x */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep6_tx_fifo_wdata;

    /* 0x16C : ep6_rx_fifo_rdata */
    union {
        struct
        {
            uint32_t ep6_rx_fifo_rdata : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep6_rx_fifo_rdata;

    /* 0x170 : ep7_fifo_config */
    union {
        struct
        {
            uint32_t ep7_dma_tx_en         : 1;  /* [    0],        r/w,        0x0 */
            uint32_t ep7_dma_rx_en         : 1;  /* [    1],        r/w,        0x0 */
            uint32_t ep7_tx_fifo_clr       : 1;  /* [    2],        w1c,        0x0 */
            uint32_t ep7_rx_fifo_clr       : 1;  /* [    3],        w1c,        0x0 */
            uint32_t ep7_tx_fifo_overflow  : 1;  /* [    4],          r,        0x0 */
            uint32_t ep7_tx_fifo_underflow : 1;  /* [    5],          r,        0x0 */
            uint32_t ep7_rx_fifo_overflow  : 1;  /* [    6],          r,        0x0 */
            uint32_t ep7_rx_fifo_underflow : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31         : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep7_fifo_config;

    /* 0x174 : ep7_fifo_status */
    union {
        struct
        {
            uint32_t ep7_tx_fifo_cnt   : 7; /* [ 6: 0],          r,       0x40 */
            uint32_t reserved_7_13     : 7; /* [13: 7],       rsvd,        0x0 */
            uint32_t ep7_tx_fifo_empty : 1; /* [   14],          r,        0x1 */
            uint32_t ep7_tx_fifo_full  : 1; /* [   15],          r,        0x0 */
            uint32_t ep7_rx_fifo_cnt   : 7; /* [22:16],          r,        0x0 */
            uint32_t reserved_23_29    : 7; /* [29:23],       rsvd,        0x0 */
            uint32_t ep7_rx_fifo_empty : 1; /* [   30],          r,        0x1 */
            uint32_t ep7_rx_fifo_full  : 1; /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } ep7_fifo_status;

    /* 0x178 : ep7_tx_fifo_wdata */
    union {
        struct
        {
            uint32_t ep7_tx_fifo_wdata : 8;  /* [ 7: 0],          w,          x */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep7_tx_fifo_wdata;

    /* 0x17C : ep7_rx_fifo_rdata */
    union {
        struct
        {
            uint32_t ep7_rx_fifo_rdata : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep7_rx_fifo_rdata;

    /* 0x180  reserved */
    uint8_t RESERVED0x180[112];

    /* 0x1F0 : rsvd_0 */
    union {
        struct
        {
            uint32_t rsvd_0 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rsvd_0;

    /* 0x1F4 : rsvd_1 */
    union {
        struct
        {
            uint32_t rsvd_1 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rsvd_1;

    /* 0x1f8  reserved */
    uint8_t RESERVED0x1f8[4];

    /* 0x1FC : xcvr_if_config */
    union {
        struct
        {
            uint32_t cr_xcvr_force_tx_en : 1;  /* [    0],        r/w,        0x0 */
            uint32_t cr_xcvr_force_tx_oe : 1;  /* [    1],        r/w,        0x0 */
            uint32_t cr_xcvr_force_tx_dp : 1;  /* [    2],        r/w,        0x1 */
            uint32_t cr_xcvr_force_tx_dn : 1;  /* [    3],        r/w,        0x0 */
            uint32_t cr_xcvr_force_rx_en : 1;  /* [    4],        r/w,        0x0 */
            uint32_t cr_xcvr_force_rx_d  : 1;  /* [    5],        r/w,        0x1 */
            uint32_t cr_xcvr_force_rx_dp : 1;  /* [    6],        r/w,        0x1 */
            uint32_t cr_xcvr_force_rx_dn : 1;  /* [    7],        r/w,        0x0 */
            uint32_t cr_xcvr_om_rx_sel   : 1;  /* [    8],        r/w,        0x0 */
            uint32_t cr_xcvr_om_rx_d     : 1;  /* [    9],        r/w,        0x1 */
            uint32_t cr_xcvr_om_rx_dp    : 1;  /* [   10],        r/w,        0x1 */
            uint32_t cr_xcvr_om_rx_dn    : 1;  /* [   11],        r/w,        0x0 */
            uint32_t reserved_12_30      : 19; /* [30:12],       rsvd,        0x0 */
            uint32_t sts_vbus_det        : 1;  /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } xcvr_if_config;
};

typedef volatile struct usb_reg usb_reg_t;

#endif /* __USB_REG_H__ */
